{"reviewer":{"0":"MarkSinister","1":"Late664","2":"Lukas Neidlinger","3":"Cristina Cena","4":"Dan","5":"Billy SR01","6":"Lance Mendoza","7":"Crystal Segovia","8":"EXTOL","9":"Keen","10":"Ryan","11":"Mark Schrader","12":"Lacey","13":"k.padil","14":"Rose","15":"G. Thomas Wilder","16":"Dom","17":"Chris Tek","18":"Todd in AZ","19":"Computer Geek","20":"The K Fam","21":"RadGH","22":"Matt D.","23":"MinKun Juen","24":"Jables","25":"OMAR","26":"BillieJo Bennett","27":"Arielle M McDowell","28":"N. Vazquez","29":"George","30":"Julie","31":"Bennie Mcghee","32":"Joshua Eby","33":"Justin","34":"Amazon Customer","35":"Fuad","36":"akira","37":"Kiwi Max","38":"Shannon Phelan","39":"Gates Glenn Hegle"},"content":{"0":"Like the mouse you can program this keyboards extra buttons to open programs.... But...The place where the special buttons are located are near keys I use often like Ctrl, Shift, Caps and Tab. I'm used to going all the way to the edge to find those keys without looking down. But I found myself pressing the special keys from time to time wondering why I can't copy and paste... It's because I'm holding down the special key and not the Ctrl.Annoying. But now imagine you program those key to open a program or the browser.... Yeah...Still it's one of the sturdiest keyboards I've ever used. It also weighs a ton compared to other keyboards I've used in the past. The parts don't feel cheap and the keys have some bounce. Though they can be kind of loud. But I like it.If you have to beat up someone use this I think it will do Maximum Crit Damage!","1":"I do design work by trade so my keyboards have always been top tier - reliability, comfort, features etc are important when you’re using it for hours and hours every day.I bought this for my kid’s PC. She loves the colors and that’s all that mattered to her.I got this on sale for $20. It’s not a mechanical keyboard but it feels 80% like a Logitech Romer G linear feel.The macro keys along the left side gets in the way a lot if you’re not used to it. But, those keys so work perfectly for what they are for.For the sale price you can not buy a comparable keyboard new. It feels good to type on, compact and feature packed.","2":"This keyboard is worth the money. There is a few things I dislike. The custom “E” keys makes the keyboard harder to adjust to. The material feels nice however the key press leaves something to be desired.There are multiple things I do like about the keyboard. I do like the ease of plug and play compared to other RGB keyboards. The brightness is great and adjustable without additional softwear. Over all this keyboard is an above average entry-level keyboard and if you are on a budget is probably the best bang for your buck you can get.","3":"Viene como esta descrito. En mi opinión es de muy buena calidad y el efecto de las luces le queda muy bien.los materiales son de buena calidad y funciona muy bien después de unas dos semanas de uso.(hace un poco de ruido, pero es aceptable).nota: las inmagenes no le hacen honor... se ve aun mejor cuando lo ves fisicamente. 100% complacido","4":"Very impressed with the quality of this keyboard! The cord being braided is really nice especially since my last keyboard stopped working after the cord was caught in a drawer.  I paid more for my last keyboard and it wasn't nearly as nice as this one. Very pleased!","5":"This keyboard is feels good, not so loud and it has RGB. The shipment came to me in it's original box with a label slapped on it so box abit dang up, but the keyboard works. RGB light seems okay but not as bright as I wanted it to be, still it looks awesome. I got this for working the office and now everyone knows, I work and play hard.For this price I felt I am stealing it, just get it.","6":"The keyboard is very soft and mechanical. Its gonna take a bit of time to get use to the macro keys on the left side, but overall really enjoy the light effects!","7":"• Sleek design• So quiet• Heavy & well built• Nice font on keys• Adjustable backlighting (can choose color or it will rotate though all of them)• Additional Keys form gaming• Doesn’t have a wrist rest, but leaves room for a  memory foam one which I prefer• Best keyboard for the price… What a steal!","8":"The lights are cool and I got this just for a keyboard and not for gaming.  Many keys get stuck randomly and it wasn’t because I spilled anything in it.  Control key gets jammed a lot.  But since it’s just me doing work it’s tolerable","9":"The keyboard works fine. It can be set up for different displays which is fun. In low light the letters and numbers on the keyboard are hard to see.","10":"its a good keyboard for its price, but its kinda clumsy for example i took off my spacebar off and it broke one of the stabilizers but thats not the biggest deal so i recommend it if your  just going to game on it","11":"I bought this for my home office setup, not to game. Back light is very nice, keys are responsive but not too noisy like an actual mechanical keyboard, and the programmable keys are a nice touch for launching calculator or any other custom macros. For the price, you can't beat it for a home office. Probably would not recommend for gaming as the keys aren't as precise as you would probably like.","12":"It is actually super cool and way better than I expected bc of the price. I always live by \"you get what you pay for\" but this was not the case here. It was pretty heavy when I pulled it out so I immediately thought, heck yes!! Love the lights, buttons etc!","13":"My kid is a gamer and goes through keyboards like water. So this one was afford and cool looking with the back lights . Still holding up and hasn’t given him any problems. I can hear him slamming away at the keyboard and wonder how it hasn’t broke yet.","14":"I do love this key board the keys are quite and smooth yet you know when your pushing them. Would recommend for any use. Rgb just an extra I don't care about so its nice to be able to turn it off.","15":"I was looking for a backlit, wired keyboard and I'm not a gamer but this was positioned as a gaming board. What I noticed when it arrived and was unpacking the contents was how heavy it was. Further, after running through a good bit of keyboarding (typing for the old school man I am), the keys were easy to access, seemingly designed at an optimum height for finger placement, very responsive and most importantly easy to see. This keyboard so far has exceeded my expectations. Rock Solid. Great buy!","16":"Felt nice for some applications but the keys are a little heavy to press for me. , especially for gaming.","17":"I bought dozens of these keyboards. I could not pass up the great deal. They are not the best but not the worst either. I'll flip these for a few extra $ to each to my customers. It's a Win Win for me and them!","18":"Bought it for my 10 year old. Not very fancy compared to expensive gaming keyboards but great for a kid.","19":"I use this keyboard on a DAW in a music studio.  The lighting is usually low and the lit keyboard makes it easier to find the keys\/functions I want.If the key tops were backlit it would be even easier.","20":"I saw a sale for this on an amazon affiliated twitter account. It was listed at 14.99. The shopaholic in me thought, DAMN its normally 50$, that is a bargain! I even already have a fantastic keyboard (the corsair k70 rapidfire I bought 6+ years ago) and I still pulled the trigger on this to use as a backup keyboard and with my laptop I keep in the other room. I was not disappointed. The build quality is very good, rgb is great, keys feel good (not as good as my k70 but maybe i just need to get used to it) and overall is a great keyboard to get into gaming or just general typing. Also has gaming macro keys, media keys, and programmable rgb with software configurability.My only disappointment with it so far is that it didn't come with a wrist rest. Perhaps that is something I had just gotten used to with my K70. Still, this value is so incredible I would not flinch picking it up for $15. If you see it on sale, go for it.","21":"I bought this and an $80 Roccat keyboard. It's comparable, seriously. I gave this one to my roommate. It was meant to be a backup keyboard but it was such a shame to put this fantastic keyboard in my closet. My roommate loves it. No complaints at all!","22":"Very well made and feels it. It weighs like there has been thought and quality materials used. Action is really awesome, not loud as traditional mechanical gaming boards but just enough to give you audible feedback. Colors are vibrant and plenty of cool color choices and preset eye candy. Going to order a few more just to have.","23":"Considering the price, I strongly believe this is one of the best affordable keyboard, but please have in mind that this keyboard is THICK. Like so thick that all other keyboards suddenly become think as heck. (If your hand is small, or short, you may have to find different keyboard)","24":"I try pushing back on but it won't stay. Got a new one. Change review. It's really nice and great price","25":"I've been using it for only around 5ish days but I can already say it's a lot better than some of the other keyboards I've used. The Macro Keys on the left side were odd at the start but once I adjusted to them being there I just used the keyboard normally. The feel is really nice too, it has the premium feel while also being pretty cheap (I bought it for 15 but originally was going to but it for 20). I'm not too much of an LED type of guy but they look cool I guess. I haven't really checked if they have any programs for the leds\/macros but the leds are fine at what they originally are, I don't really seem to notice it while playing video games.","26":"Husband is a big man and hates tiny keyboards. This is a very large keyboard and super durable.","27":"I can see my keyboard and it gives me a happy affect with the lights.","28":"I was looking for a replacement keyboard that was mechanical and this met my need. Solid feel and smooth keystrokes and the RGB and programmable buttons are a bonus.","29":"Pretty sturdy !works well and has  fancy looks","30":"perfect for the price","31":"Bought it to use with laptop. Should’ve went wireless. My 4 month old niece loves banging it. The key sound entertains her. Future hacker of America.","32":"I knew before I bought this keyboard that I'd have to get used to the position of the programmable keys, but it's way more jarring than you would think. Anytime I put my hand on the keyboard I automatically put my fingers on the WASD and shift keys, but I never realized how second nature finding those keys was to me before I tried using this keyboard. Anytime I would try on this keyboard my fingers would instinctively go to the far side of the keyboard. The far side of the keyboard being where those silly programmable were located. It would then take me at least a couple of seconds to realize why my inputs wouldn't work like I was wanting them too. Other than that though the keyboard feels nice to type on, and the RGB lights were easy to cycle through to something that isn't a rainbow strobe light.","33":"a little uncomfortable with the macros on the far left. otherwise great features and price. worth the money.","34":"Bright, heavy duty, ease of key use.","35":"good","36":"There's a setting to change the start button and the fn key. Such a game changer!","37":"Great value for the money.  Additional features are great if you're on PC.","38":"I love the keyboard I just set it up, typing on this keyboard is nice, button presses easy and not super loud, the only thing is the brightness, probably dimmer then some RGB keyboards, but it's not too bad considering the price. I need to get used to the layout, as I am used to the logitech wave keyboard, it's so different.5\/5Perfect gift that doesn't break the bank, for anyone not just gamers.","39":"Im so glad I bought this when it was on sale, very good for your money, highly recommend."}}