{"reviewer":{"0":"AS","1":"Tammy","2":"DMX","3":"Kat","4":"Shelbie Walther","5":"laprof","6":"Autumn Moore","7":"Vic","8":"Jessica Erika Santos","9":"Melissa Thomas","10":"Katy","11":"redolent kate","12":"Jill Allison Bouhlev","13":"Meredith B","14":"Grecia","15":"Kelly Sharp","16":"Janaya D.","17":"K McGinnis","18":"Winfield Zangrilli","19":"Tazziemom","20":"docsuse","21":"AK574","22":"Kalei O.","23":"Myracle B","24":"Richard Simmons","25":"Laura Cannon","26":"Tracy Noah","27":"L.M. Pawlowski","28":"Laser Enthusiast","29":"Stormy M."},"content":{"0":"I am a regular size 9 so naturally I ordered the 9-10s. When I got them, something was kinda off. These were just a tad too short so my heel was right on top of the lip on the back. Later on that day I ordered the 10.5-11.5s so I could try those instead. I got them yesterday and holy hell it took me all day to decide which ones to keep. The bigger pair is BIG but my feet fit perfectly into the insole and they’re a lot more comfortable. The strap is a little more loose, naturally but not too much of an issue for me. I’d walk around in one pair then switch off, each time I’d think ok these feel a lot better, no THESE feel a lot better. The strap on the smaller pair fits nicely, not too snug but the fact that my heel hangs off the back just a teensy bit makes all the difference. It’s definitely uncomfortable. I’m going with the 10.5-11.5s.I did read a lot of other reviews to get more info as I am worried that the larger pair will stretch out. From what I’ve gathered, it sounds like none of these sandals are actually all made the same, all sizes are not the same exact size, there’s deformities in each sandal. I guess we just need to deal with the trial and error if we receive a wonky pair.All in all I’m happy with the bigger pair. They’re extremely comfortable and I love the color. I work from home, I’m in a new house and my resolution is to keep the floors more clean, everyone must take their shoes off at the door so these are a great option for inside house slippers. I definitely won’t be wearing them out in public or even the backyard.","1":"After reading some of the mixed reviews, I was hesitant about getting these, but I needed new slippers. I’m a size 7.5 in most shoes and was torn between getting the women’s 6-7 or 7.5-8.5. I eventually decided to get the 7.5-8.5 size to account for the raised edge and for any shrinkage that might happen because it’s so hot and humid in NY lately. They’re very roomy around the band but otherwise they fit perfectly. They do however look very big when I’m not wearing them but once they’re on your feet, they look normal-ish. I don’t mind since I plan to only wear them indoors. They’re also very supportive and comfortable to walk in. They have just the right amount of softness and firmness while still being very lightweight. When my mom tried them on for a bit, she wanted a pair as well.","2":"They are very soft and dirt does not stick to them, so I can go into the backyard wearing these and walk right into the house even if a bit wet. However, they catch on everything and I have almost fallen several times while walking on a hardwood floor or just moving one foot too close to the other, very strong grip on these, a trip hazard, so be aware. Also, they started to split a bit on the right side of the right tow, but I am wearing them a lot, will probably last an entire a year or less.","3":"As you can see I have bad feet. I retain fluid bad so my feet and legs swell at times. I also have issues with my toes going numb A LOT and honestly I'm a whiney person when it comes to shoes and my feet. First I usually wear a size 6 1\/2 but with swelling issues I can go up to a 7-7 1\/2. I got the size 6-7 1\/2 and they fit great. I got these to wear in the house and I just ordered another pair to wear around outside. Very comfortable I also got another brand in same size but sending them back because they do not fit or feel as comfortable as these. Right now my feet are not as swollen but I know when they do swell these are still gonna fit cause they are not tight fitting. I'm really satisfied and the price was not bad. Support is good, I have RA too so that's something very important to me support, comfort and the softness not so much but they do not hurt my feet. I recommend to anyone with RA and issues with your toes.","4":"I hesitated on the purchase.. but SO glad I went for it! We have concrete floors at home, and I wear dress shoes at work every day.. so I NEEDED comfort shoes around the house. Your typical house shoes were NOT cutting it for me! I’m so glad I got these. My feet are definitely spoiled now because I can’t walk barefoot around the house or else my feet hurt so bad and I can instantly feel the pain! These are so great!!","5":"These have become my house shoes, for walking with a little cushioning on hardwood and tile floors, and even to run outside to water plants and such. They are cushiony soft, easy to slip on, washable (rinse with a hose if you're outside!).  There isn't any special arch support, but the cushioning makes it unnecessary.  I do feel they look like I am wearing  shoe boxes on my feet, because they are that big, but who cares when they're comfy!  I was worried that they're so thick that I would trip over my own feet in them, but it's not a problem at all. I ordered the 9-10 which are roomy, but I think the 8.5-9 would have been less clunky.  If I were at a swimming pool, these would be my choice to walk around it instead of flip-flops because the bottoms are channeled and less likely to slip (see photo).  For the money, I've already gotten my value from them in three weeks' wear. I found these from some instagram fashion thing that came up on my Facebook feed, and while I can't imagine wearing these in public (beyond a pool or nail salon) or as a fashion statement, they are THAT cushy that I understand if someone did. Friends who tried mine on were instantly sold on them and ordered a pair right away.","6":"I have plantar fasciitis and was looking for something to wear around the house. Any time I  would be sitting or laying for periods of time then get up my arches of both feet would hurt. I bought these after reading the reviews. I was not sure at first as they were really soft. However, I tried them out and I knew they worked because when I would take them off my feet would hurt like I was sitting again. They are not the prettiest shoe but I would defiantly recommend as a house shoe to relieve foot pain.","7":"I've had these slides for a few weeks now and they seem to be built to last but they are snug for my extremely wide (4E) feet. I typically buy Adidas adjustable slides a couple of sizes bigger and I did the same with these Cloud Slides but walking around in them feel clumsy because my feet keep bumping into things when I have them on and I've never had that problem with the Adidas slides. The thick sole really does provide a lot of cushion and support even for a heavy person like myself and they haven't lost any of it's original form as I wear them for hours on end around the house. If and whenever I find myself needing a new pair of slides, I hope to get something similar that's adjustable.","8":"My sister bought this for herself, of course, and for mom. At the time I didn’t want one, but boy was I wrong. We have tile floors and being on your feet most of the day doing chores and cooking, your feet starts hurting. I ended up using my sisters one while doing laundry and OH MY GOODNESS. (I’m not exaggerating) it’s sooooo soft and comfortable. I used it the entire day around the house and almost forgot I had it on when I stepped out to garden. I’d secretly use it whenever my sister is out. Let’s just say, I ended up buying myself one before she finds out and throws a fit.","9":"I am not sure what I was expecting but these babies took my breathe away the instant I put them on. I literally stood in amazement for several minutes with my mouth wide open staring at my feet wondering if I had just stepped into another reality. I have sensitive skin on my feet. I’m 5’5” and about 125 lbs so I’m not packing on extra weight or anything. I was just hoping for some summer slippers for the house that were comfortable and helped me avoid touching my bare feet to carpet. These are still blowing me away after wearing them for a week. I feel like I’m walking on air. And the price is amazing for these godsends!! AND the skin on my feet is healing. I’m buying another pair to wear out and about (and probably many more) because I want to feel this good everywhere and all the time. My husband was laughing at me today — why are you so happy?? Literally, it’s these shoes. I don’t even like to write reviews but I would be remiss if I didn’t share the bliss that is now my life. I want to buy a pair for everyone I know! So do yourself a favor and purchase these babies. I dare you to be in satisfied. Am I over selling? No, no I am not ha!Oh one other note to be aware of. I am a size 7.5 normally. I ordered the 7.5-8.5 for women and they fit but are ever so slightly too big to wear out and about, so I’m getting the smaller 6-7 ones for outside. I’m a bit of a clutz and am tripping over myself indoors but I like the larger size for lounging.","10":"Alright, you all win, they’re actually that comfortable. I was hesitant to try them because I have a pretty lengthy history of plantar fasciitis, and need good quality shoes to fight the pain. These are so cushy that my heels don’t feel any contact at all. I would say these have typical support, and I’m not sure I would wear them for all day wear, but they’re fantastic for around the house, running errands or pool days. The blue color is awesome too.","11":"These are super comfortable, soft slides. Beautiful colors. Love them.....but: I bought several different colors after my initial purchase because Ioved them so much. The ones to follow were widely different in size, i.e. huge compared to the first ones I bought. I ordered the same size each time, yet the actual  slide was not the same size. All were labeled size 42, but were measurably different in size. I ended up returning 2 times and finally kept one of the pairs. Now I have 2 pairs, both are size \"42\", yet extremely different in size. One I have for wearing barefoot and one I can wear with socks and barefoot, yet a bit loose. I am hesitant, but may try to order a size down, maybe my first pair was mislabeled in size and the ones that followed were an actual size 42?The short answer -- these are awesome if you want to roll the dice until you get the pair that fits you,  as you can't count on the size you order being the size that fits.","12":"Cheap little shoes but I wear them all the time. I wear these to the gym and use them in the shower so I feet don’t touch the ground. I wear them around the house as well instead of slippers. They work better for me because sometimes my floors are really slippery and I don’t have to worry about fine. They’re very comfortable and I love the color. You can’t go wrong with these things","13":"I absolutely love these and am so happy to have gotten them off of a recommendation from a friend. They are a fraction of the cost of other brands that achieve the same fit and comfort and I'm so happy I could get a good pair for a great price. I will say you should size up. I initially got the 10.5-11.5 size since I'm usually a size women's 11. I understand how the manufacturer classified it as an 11 because it technically is, however because it has the ridges on the side, it actually makes the slide where your foot hits it smaller. So when i was first trying them out, my heel and big toe kept hitting the edges. It wasn't uncomfortable, however, it was annoying. I decided to get the 12-13 size and it's a much much better fit!10\/10 would recommend and I will definitely be buying more pairs!","14":"The shoes are sooo comfy and has so many cute colors!! My only thing with this shoe and it could just be my foot but it’s that the “band” is a little too thick\/ long so there isn’t a lot of air flow. After a little bit of wearing them and then removing your foot you can feel the cold air. (If that makes sense) but don’t get me wrong the shoes are sooo comfy and I won’t be returning them! (I’ll probably buy another pair too!)","15":"I did not know what to expect from these slides but from the instant I put them on I fell in love, feels like I'm walking on a cloud! I have a horrible back...top to bottom and when standing for more than 10\/15 minutes my entire back is on fire. With these slides I can stand for an hour or more with ZERO pain. Unbelievable. I highly recommend!","16":"I'm a true 7 and when I ordered the first pair ny big toe it the very end of the shoe and my heel barely fit. I ordered a size up and my foot fits in the show but the perimeter of the shoe is much bigger. I guess that's just how it has to be because I can't go smaller. So very odd that  the perimeter of the show has to grow with the length, but I bought to walk around in my kitchen so they serve the purpose. The second pair didn't come in a box. Came stuck inside eachother wrapped in plastic so bent out of shape a bit. Some people said use a blow dryer to mold better to your foot. At any rate, they seem ok. Can't speak to how durable they are yet.","17":"I got these for Mother’s Day as a gift. I hate shoes but my feet hurt when I go barefoot. I was skeptical until I put them on and started walking in them. These are great. I even wear with socks when it’s chilly they are that comfy. I don’t wear in public but you could. Mine are dirty from wear so I will need another pair.","18":"I have these in 4 colors! I have awful feet and suffer from plantar fasciitis. I have the special inserts, the socks, the ice packs and the expensive shoes. Nothing has worked like these! I got some for my husband and he ordered two more pairs. I gave them as Xmas gifts and one of the girls said it cured her plantar fasciitis as well. My daughter tried to steal my black ones so I ordered her some and her boyfriend has bad knees and he ordered some as well. Are they the prettiest most trendy shoes? NO. Do my feet hurt when I'm on them all day? NO! So I ask again, \"Hey Bronax...where's my commission check?\" LOL! My friend asked me yesterday what was I going to do when winter came. I answered, \"Socks!\" haha! Seriously love these things!","19":"I love love love these shoes that I now have 3 pair.  I have horrible plantar faciatis, heel spurs and other problems with my feet and they are always hurting and for a while there I could barely walk.  I was told that I could not go barefoot anymore and I found these and they allow me to walk and move again.  I recommend these to anyone that has bad feet or tired feet because your feet will feel like you are walking on clouds.","20":"Bought these because we moved to FL and the floors are all tile. Awful for my back and hips!! These make a significant difference and keep me from getting super fatigued and hurting. However, after wearing them awhile and walking around the house, they get uncomfortable in the sense of sweaty feets. No breathability at all. You cannot expect to wear these for long bouts of time.","21":"I was surprised by how comfortable these sandals were! We have travertine floors and they kill my feet. I bought these to be inside support shoes for the hard floors and they’re wonderful. My only complaint is they’re ridiculously squeaky. We don’t polish the floors or use cleaners so I’m guessing it’s the shoes? Anyway, I don’t mind enough to not wear them!","22":"Okay, so I’m an avid, honest review leaver because as most do, I go to reviews before making a purchase . I review everything I buy, just so people don’t have to go back & forth with conflicting reviews . So, with that being said, these shoes are definitely not necessarily “cute” under most peoples standards, but tbh, I personally, will still wear them out in public because my “cute” fashion standards are different than most (I wear fuzzy slippers with 90% of my outfits out in public, also from Amazon) :P Besides the looks of these slippers \/ house shoes, the comfortability is immaculate . When I put them on, I was in disbelief, I know people said these were comfy, but I’ve been let down before, but not with these ! These are 10\/10 comfortable & I will most definitely be buying more colors . HOWEVER, the sizing is weird… I usually wear 8.5-9 , but I usually size up just to be on the safe side so I got the 9-10 & I’m SO glad I did because these literally fit perfect . They’re not too big or too small, & I’ve been debating on sizing up to the next size but I’m scared they will be way too big … Anyhow, if you don’t care about “style” but are big on comfort, BUY THESE . My feet constantly hurt from standing the majority of my day & once I put these on, it relieves the pressure . The mauve color is really pretty too ! (:","23":"They feel like rubber slides I just replaced with more cushion. They aren’t extra bendable or fluffy, and they don’t feel like marshmallows. They don’t provide a lot of support either I find after a couple hours my feet still hurt and when I first started wearing them which is today it would make my legs want to smack each other. So leaning in towards the knees as if I was knot kneeded, so to correct that I just lean the other way. I don’t know it’s my first day wearing them my grandma thinks I will be able to wear them in and fix that support issue. Will I buy them again? No I’d try another brand to get that dream cushion we have all seen in the ads. With that being said, I will continue to wear them- they get the job done and I don’t feel like returning them and all that.Update the side\/upper edge of the shoe digs into my skin after wearing the shoes for a bit. Not like a blister or some type of wound but more of a sore feeling. But I did realize that my knees were hurting and I was really achy from doing a lot of work and I put these on it it seem to alleviate a lot of my walking pain.- update I’ve had it for some time now and my feet now have dark marks where the edge of the shoe rubs on my skin. They still work the same way but I do find myself tripping here and there.","24":"I was the type of person who wore slippers all year round. I had trouble finding a good pair of affordable slippers and was tired of my feet sweating in the summer so I tried these. Wow. They are like walking on air. So comfortable and they weren't as ugly as I thought they were going to be either.","25":"I don’t like going barefoot in the house. Used to wear a pair of cheap flip flops around just so I wasn’t barefoot. I noticed my ankles and feet started to hurt when I wore those very often and wanted to find something comfy with a little more support. These do the trick! I usually wear a size 7.5 to 8 shoe so I picked the 7.5 to 8.5 size. They fit great and are really comfy for my lounging around the house days!","26":"Very comfortable but runs a little big, could have gone down half a size.","27":"Was hoping it would fit as snug as my Cushionaire sandals but they have a looser it. I usually wear a 9.5 size shoe … and the 9\/10 size sandal I bought is comfortable but almost on the verge of being too loose.Great for around the house or casual runs to grocery store, etc. I get compliments on them wherever I go ! They’re very comfortable.","28":"I love the comfort of these indoor slides, however they are too tight for the width of my feet. If the strap was not as narrow they would be perfect. They feel like walking on air. Unfortunately I'm not wearing them due to the width and sticking with my crocs.","29":"Hands down best shower shoes! Comfy, great support, non-slip, I do NOT trip because the soles are so thick, they don't slide off while wet and walking back from my shower area down the haul from my dorm room, and don't make a squishing sound when walking. They do run a half size larger than order. Size 7 is size 7.5. However, being a half size larger actually made them more efficient."}}