{"reviewer":{"0":"Alex","1":"MSChar","2":"Joshua","3":"adiane","4":"Chris P","5":"Robert S.","6":"Christopher P Bailey","7":"Amazon Customer","8":"Electronic Juggernaut","9":"Russell Knick","10":"The Pangalactic","11":"Amazon Customer","12":"Max H.","13":"Annalise","14":"Kaizen","15":"Tashawn Nicholas","16":"amber poole","17":"AC BC DC","18":"Eva","19":"Aaron","20":"Amazon Customer","21":"James Elliott","22":"SpriteDaddy","23":"E. Y.","24":"flamingoland","25":"Ryan C.","26":"Dissolved","27":"Navi","28":"Brian Bub","29":"Jasmin Videla","30":"Mike","31":"TheOneTrueEros","32":"Lord Dark","33":"Erick","34":"Reviewer 239863428","35":"Brandy","36":"Lucky Day","37":"song you","38":"Justin","39":"Amazon Customer","40":"Ryan","41":"Yuhna Del Rosario","42":"German Mendoza","43":"Shawn Leeper","44":"Kai","45":"Rob D'Aquin","46":"Kurosaki","47":"bret O'brien","48":"TurtleThumper","49":"Jaboure"},"content":{"0":"My old wireless keyboard was acting up so I needed a new one. Was originally looking to get a wireless one but all of the options that looked good cost $100+.  I don’t do any crazy gaming, and mainly use my keyboard to occasionally write and for photo\/video editing.This keyboard had good reviews so I gave it a shot.  I’m not a fan of always on leds but this one has a setting so that the lights stay off until you type, which I have no issues with.  There’s also a knob for controlling the volume, and 3 buttons for play forward and rewind.  Those came buttons can be programmed to do other stuff.The keys took some time to get used to typing on. But so far I’m liking it.  I have no issues with the keyboard, lights or other aspects of it.  Once I test it out more I’ll update.  But it is an affordable mechanical keyboard and I’m liking it.","1":"I bought this keyboard on a whim since it was on sale and I was like what the heck. I read it had black switches which I believe are a cross between red switches and another color switch I forget. I'm coming from a brown or blue switch keyboard which has a very responsive \"click\" when pressed and strong feedback. They keys on this keyboard feels kind of sticky as the spring is slower to respond almost like the keys follow your fingers. Sorry that is the best way I can explain it. I realize that sticky feeling and slow feedback is not my thing.","2":"The product has worked great since I got it. Though it can be very sensitive to touch and a key seemed to stop working as well. Not sure why, I have to press it multiple times before I get it to work.","3":"I waited a while before reviewing this because my last keyboard quit on me a few months after purchasing. I didn't know it until I bought this one, but I love the black switches better than the blue. I bought it for the retro look. I wish the keyboard itself was black, but it doesn't make me love it any less.It doesn't have as many options in color sequence as my old keyboard, but I definitely like the keys and switches better so that overrides unavailable options.I definitely recommend if you want a cheaper, wired keyboard. I'm pleased with my purchase this far.","4":"I’m not a gamer but this keyboard is perfect for my daily use. It’s not too loud but the keys feel good. They keys are a bit different as others have noted where they are not beveled.. but after a few days it didn’t matter anymore. I love the media controls too.","5":"Its a nice keyboard but there is an adjustment period to typing with it, lol... The click is very nice I like the sound and the feel. The adjustments to the lights was a little difficult at first but I didn't read the directions so that's on me :) Overall I really like the keyboard and having that volume control so easy to reach is amazing! I feel like for the money I got more then expected and that's a win for me...","6":"I like this keyboard. I originally got because it looked different, which it certainly does. Many different color options and set ups, click the knob to change.As for gaming, I don’t do much MP gaming anymore. For other games it is fairly easy to use once you get used to it.","7":"it has some cool animations and feels really good. i had no problems switching from my old keyboard to this one.","8":"For a mechanical keyboard, these keys are QUIET. They're not like perfectly silent but they blew my expectations away in the silence realm.","9":"This is the first mech keyboard I've ever bought and I'm so glad to have made the switch. the keystrokes are smooth and the LED lights are amazing.","10":"The good:It's brightIt's prettyThe bad:The keystroke length and the keycap size are mismatched, and slows down typing. (The shorter caps feel wobbly on the long stems.)No satisfying click on keystroke... just the sound of plastic on plastic, not the feel.The lights are NOT programmable or editable, the color is locked per key. (You can edit the *effects*- glow patterns and such, but not the color.)$50 is too much for this.The workaround:I bought a SteelSeries Apex 5 to replace this with. The keycaps are compatible, and since they have a shorter profile, I swapped the keys with the Apex's keys, as they are much taller. The result is that BOTH keyboards function better. The longer stroke is offset by the taller, firmer, rubberized keys from the Apex, and the shorter keystroke on the Apex is a better fit for the chromed Fiodio caps. Moral of this story- better keycaps fixes usability and I just don't use it on my primary system, but it works well on another workstation.I can't recommend this one, but it's got potential if you can get it on sale.","11":"Looks cool and has a volume wheel is the best feature set.Scroll wheel is nice. You have to press the button in the wheel to change the RGB settings (which locks the volume just fyi). Played around with it to figure it out.Keys are horrible on this thing. Mushy and lots of side play. I got this as a replacement after spilling water on past 2 Corsair keyboards, but it's not the same thing and not fun to game on. Going back to a nicer one Corsair again.","12":"Nice keyboard! Lights look great and I’ve had no issues with connections or key responses. Let’s feel satisfying to touch, and the magnetic hand rest is a nice addition. This keyboard is LOUD. I know that’s the appeal of buying a mechanical keyboard, but just know you will hear that clacking (and so will your SO if they’re in another room)","13":"This keyboard is awesome, it types like a type writer and there are several choices for color modes.","14":"You get what you pay forI personally don't like the way it feels but it is very prettyBy feels I mean the spacing of the keys, as well as the key press","15":"I dont know what's up with this design, but this keyboard is nearly impossible to type on without adding a multitude of mistypes and double clicks.Looks pretty.Nice and glowy.Cant type for crap on this thing.","16":"The media could not be loaded.\n                \n\n\n\n I made the mistake of just looking at this and thinking it has colors so therefore there must be other colors to choose from. WRONG. These don’t change colors at all. You are stuck with those colors on those specific keys. And they are ugly to look at after a while. The only thing you control is the visual effects. Avoid my mistake if you can!","17":"The media could not be loaded.\n                \n\n\n\n I am not a gamer.  I go this primarily for its backlit keys.  I don't really understand why gamers needs such a pretty keyboard.  I think maybe some keys have special purposes for gaming and so are similarly colored.  On my keyboard for e.g. keys ASDW, up, down, left, right are colored differently from all the other keys - purple.  The number keys on the number pad are yellow, the operators red, the number keys on the main keyboard are red, the other letters turquoise(? one of those light blues) and the function keys are a bright blue, the home, ins, pg up etc. are green.  There are various effects for the lighting which I really dont get the purpose of.I like that there is an indicator for caps lock, and num lock and also a windows lock key.  Not sure what it does.There is a lot of play when pressing the keys.  You don't have to press hard but here is also space between the keys so it feels like you will press more than one key at a time but its surprisingly accurate.  The body feels good.  It sits a little high off the table surface as compared to my logitech wireless keyboard.  So I'm not happy about that.  It forces my wrists up - I like my keyboard as flat as possible.Its not particularly noisy either.  I was expecting a loud clickety-clack-clack but not really.  My other option was to get one of those membrane keyboards and I am not a fan of them.  Dont like the feel.Thankfully the lights turn of when your PC sleeps.  Otherwise I imagine this could light up a dark room.Docking a star because I cant find a mode where all the keys are lit up the same color.  Why not man?  All these weird strobing and running and flashing effects but no ability to have just one solid color.  That feature for me would have made this a 5* keyboard.","18":"Keys are too flat-ish and fingers glide across them making easy to type extra keys by accident. LED is bright and nice to look at. Build quality is ok.Mine arrived with Ctrl and Windows key being always in the pressed state. I took it apart to see if I could easily replace the key switches(I don't actually know if the switches are the problem) and they are soldered. While I have a soldering iron I'm not going to bother and will just return this item since I couldn't identity the problem with absolute certainty.I posted a picture of the PCB in case anyone is interested.","19":"The only thing I don't enjoy is typing. Too many accidental key strokes.","20":"1","21":"I used this keyboard a couple of days and then returned.. It just feel didn't feel right. I have no complaints about it. It didn't feel comfortable to me.....","22":"This keyboard is my whole soul. I loved everything about her. From her clicky keys to her colorfulness. It was all amazing and I enjoyed gaming with her very much. Don't use it with acrylics tho, I had a bad experience there, acrylics and this board don't mix. But everything else was amazing. It's kind of hard to clean but I would still recommend it. The keys might be a little stiff at first but the more you use them the better it gets! Y'all got this hit plat this season kids!","23":"The keyboard is very pretty I love it but I wanted a keyboard more noisy when I type and this one is more quiet","24":"I bought this because I thought it would be easier to keep clean (pet hair, etc)since I grew up with an actual typewriter, I don't have any issues with the mechanism, but:a few of the keys were not right side up and I had to pry them up and fix themand if you have the light set too low, it's difficult to make out the charactersI haven't used the volume control","25":"There are things I really like about this keyboard and things that make this keyboard 100% the worst keyboard i have every used.PRO:It is wired, I have had wired keyboards that literally  unplug from the keyboard which is bizarre but this is not one very happy that it is a true wired keyboard.You have music controls right on the keyboard along with the volume.They keys light up so you can see the letters in the pitch black. And you can adjust the brightness.CON:It said the lights were customizable. It is not. You can choose which keys to light up but thats not custom. You are stuck with the colors of the rainbow keyboard. Cant change the colors ergo NOT customizable.The frame is plasticAfter choosing's which keys to light up there is always one that doesn't.The keys are spaced too close together, i am constantly hitting 2-3 at a time when i go to hit 1 key.-----------This keyboard is terrible, if the keys weren't spaced together so close together i wouldn't even both with the review, would have ignored the rest of the things im picky about. For gaming for typing essays etc dont buy this keyboard","26":"Second time trying a mechanical keyboard. I don't get the hype still and this wasn't the product to change my mind. It's an OK product but not really my thing.Some good things about this keyboard:- Feels like the quality is good, I believe it will last a long time. However it's hard to say because it's the first day having it.- I like the key shape, the rounded corners are nice and the keys are slightly concave from all 4 sides, but not too heavily. I tend to prefer flat keys, but these are pretty comfy.- It does have a cool aesthetic appearance. Kind of like those Retro Diners that have chrome trim everywhere.Some things I don't like:- As with all mechanical keyboards, the keys are huge in the vertical axis. I prefer doing everything with a chiclet keyboard and I will be going back to a chiclet keyboard soon, just going to leave this as a backup.- Even though these are not clicky switches, they're still pretty loud. You can hear the springs as you type and each keycap has quite a bit of \"wiggle\" so the keycaps themselves make a lot of noise when your fingers strike them.- To me, typing feels a bit awkward because the keys have a lot of travel, but the activation point is close to the top of the travel. I'd say the activation point is somewhere around 2 mm, while I believe the keys bottom out at what feels like well over 5 mm. I don't have any way to measure it but to me this is an awkward combination for typing. Also makes it quite easy to accidentally press the wrong key while typing.- The color of the lighting is set for each key, you can't change it. There are different animated \"patterns\" but each individual key only has one color that's either on or off.","27":"Keyboard is nice and the couples are great but the keys have some dimness on them it’s not as bright as how the pictures advertise them to be. The different modes for the lights are great depending on the mood you are in and show pretty light shows","28":"The colors and light patterns make me happy. My old boring keyboard was backlit, but was not easily cleanable. It looks like this one is. So far so good on  this one. It's really nice.","29":"i personally really like this  keyboard because of the style of the keys and  it fells really smooth when you do type. i really like the different pattern of rgb  the  only thing that is some what bad is the wrist thing its kind of cheap but it gets the job done","30":"I bought this keyboard August 2021.  The keyboard itself works as expected no complaints there.But yesterday the LEDS under the number keys started flickering and the light under the ~ key has gone out.I expect the rest of the flickering lights to go out in the next day or so.","31":"They keyboard looks great, the detachable wrist rest has been helpful even though its not cushioned. My problem may just be for the one I recieved but after only 3 months with it the keyboard started acting up, sometimes it registers a key press multiple times other times it does not register the key press. I wanted to use it for programming but due to this faulty behaviour I had to stop because it was leading to more syntax errors than anything else. Of the other reviews I read i didnt see many people having the same problem so it could just be that I got a faulty one. Overall 3 out of 5.","32":"as it says q is already out hopefully the rest don't soon follow.keyboard is really geared towards kids who have to have flashing hardware,at least i was able to find one setting that was not stroke inducing.bought for the low price only","33":"I loved this keyboard while it worked but it seems like the switches are flimsy\/unresponsive my A and W keys are very very unresponsive i have to press the keys multiple times. i've tried cleaning the keyboard but with no luck. either Steer clear or buy on sale","34":"Bought this because my old Azio was starting to get a bit sticky on the spacebar and the Azio has doubled in price since I bought it.Typing with the keyboard is not too bad. I like the tactile feedback and the keys are a bit quieter than the Azio. There is an unpleasant rubbery feel to the switches, not as crisp as the Azio I am used to. Chassis feels acceptible, though they did make it slightly too small.Problems:1) The backlight looks like it was designed by a 12 year old girl. There are over a dozen different \"lighting effects\" and near as I can tell all of them are designed to distract and annoy you. The one that only lights up the \"O\" key is the weirdest to me, but I accidentally put it into a mode that lights up the key you are using, and the keys directly adjacent to it in an animation. What is the point of a backlight if it makes typing more difficult? I get that it's a gaming keyboard, but damn.2) The keys are just slightly closer together than on a fullsize 104 key unit. Not enough that you notice at first, but just enough to trip you up. I 2-finger type at 70+ wpm, and I just can't get the feel of this one. I am still hitting the keys, but my fingers are hitting adjacent keys as well. Which leads to the next problem and the reason it is going back - the delete key rattles. Ugh.In short, I got it open box for less than a Jackson and even then it wasn't worth the price paid. Too bad!","35":"If the gaming keyboard I bought previously wasnt out of stock, I wouldnt have purchased this one.  But since it was and I needed a 2nd keyboard for work, this one looked similar and I thought it would be similar in function.  The typewriter look was the only thing that was pretty much the same.  This one is not as bright, response time is not as fast and very soft\/to no sound when keys are pressed (the clicking noise is what I absolutely love).  So definitely a brand that I will not purchase again.","36":"*I,'m not exactly sure what to make of this keyboard, but after stuuudying enough of them here, you sure acan end up with worse in any regard. I ddon't know why it seems an i mpossibility to just get a chickley keyboard with wsssolid white backlights that let to wsee the dcharacter in lower light, just like the Microsoft Surface pRO, BUT YOU CAN'T. With this, you are never sure of what key you're hittingt, or how many charactrers you're typing becusen the ntravel is so weird. I love the media controls, (which mosy keyboards are horrible at), byall the littl charcters like colon and semi colon are horizontal instead of vertical like all other keyboards, so it's confusing. The keys sure do light up, but the charcters coulkd be brightter - too m uch to ask for BIG SOLID characters??I don't know. seems like for $$45 YOU COOULD DO A LOT WOrse, and for a lot more money you could do even worsee. a basic white backlit keyboard should be an easy $20.Worse paerts about this keyboard are: YOU KEEP HITTING OTHER keyts, and youneve rknow how long to press a key just to get one character insteasstead of fivvve,sure looks niiice thoough","37":"So I have bought this and gave it to my son; he loves it. He is writing this right now. Anyway, it is awesome and he likes it. It sounds pretty good and it is great for gaming. The bad thing is the stabilizers which suck and are bad. The spacebar sounds pretty bad compared to the other keys and it ok but not great. He has put new keycaps into it because he said the other ones were \"crappy\". I would recommend this and love it.","38":"I'll start by saying that this is a good  keyboard, have been using it for a few months and all works as advertised. Really like the volume control, and the backlighting looks fantastic.  That said, when i bought this, it was after I  had tried out the feel of the razers, and corsairs in-store. I really liked the feel of the mechanical click feedback from these. While this keyboard has the clicky sound, you do not get the satisfying feel of the click. Also, I have long fingers and the fact that the wrist-rest detaches and can be moved back is great, otherwise my wrist goes right over the top of it.  For the price though, it is a great looking keyboard that works as it should.","39":"I have fat fingers. The spacing on the keys is *not* quite ideal for a person of my size, but that’s just because i’m fat. Great keyboad otherwise.","40":"I got this about a year ago and keys are now starting to no longer work. But i will say that i am hard on my gaming keyboards for a light user would work fine","41":"If you're looking for something that looks cool and feels premium, this is it. If you need functionality and you need this for work, go hit that back button FAST or swipe back. I'm a fairly good typer with a typing speed of 67-70wpm. I'm also pretty patient that I thought to myself I just need a few weeks to get adjusted to it since I haven't used a mechanical keyboard since Windows XP days. But no, even when I got the hang of it, it's just too sensitive and annoyingly smooth that it repeats letters and spaces, it makes me look like I don't know how to use a keyboard. Then I get to use my friend's mechanical keyboard and I felt like a joke. Steer clear of this keyboard unless you don't need to type too much and only need an aesthetically pleasing keyboard.","42":"The keyboard feels good at the time of writing the only detail that I did not like and that they have to improve is that they can add more functions to the keyboard with the FN key and to use it with the F1, F2 keys, etc. And the other thing is that the button to change the modes when I took the keyboard out of the box I did not have it on and it is because it is removable but it would be better if it were not and the other thing is that the keys feel a little loose but the fluidity of the lights and at the time of writing the action is fast.","43":"With the light settings on this keyboard it is a lot of fun to play with.","44":"I bought this keyboard because I needed to get a new one and it seemed nice. for some reason the keyboard came in a soaked box, thankfully the keyboard wasn't wet. when I opened the box I found out the little sound\/color knob had some how broken off. I was able to use some super glue and tape to put it back on but I wasn't too happy about it. I don't know if it was the company or just amazon who was at fault for it all but if I didn't need a keyboard badly I would have gotten a refund.","45":"Replaced my Razer Ornata Chroma and got back a GB and 1\/2 space. The Razer was a hybrid, not being fully mechanical. This KB is most definitely mechanical and feels that way from the first touch. Better quality than I thought it would be also. Plus I got to get rid of that Synapse garbage software.It has taken me maybe a week to get used to this KB, but I am getting the hang of it day by day. I have not fooled with the color schemes much but looks like it has a ton of them. I wish there was a PDF online for the manual, as the one included is TINY, and my eyesight is not what it was anymore!For the price, this keyboard hits well above it's weight.","46":"For some reason in PC I was not able to use the volume. But in general its working good, this has different LED colors. But in general is a good product but if you want something better you have to pay more money. To start is not bad. Recommended.","47":"great keyboard but some people might find it anoying. great switches but the key caps are a little weird and a little hard to type with. this hand rest is nice but is plastic. the lights never claim to be rgb but its a tiny bit misleading. I know it sound like I dont like the key board but its really great, just a few flaws. great reaction time with each key so for gaming with definatly get the job done!","48":"This keyboard is not one that is easy to get used to.  The keys are very hard to press and require a lot of very accurate and heavy pressure. Have to hit the center of the space bar, and will not trigger the space at the edge of the space bar. Wish I could return.","49":"Feels somewhat great it's a good product for gaming it's not quite  though the brightness is standard so good only thing  I don't like is the chrome wish they has a black version and the losses of the keyboard"}}