{"reviewer":{"0":"Grant","1":"Ryan D","2":"Raymond Chan","3":"RG","4":"Zhichao Liu","5":"Thomas Bain","6":"Tiger Vijay","7":"Ergolad","8":"victor garcia","9":"ja","10":"E. Covelli","11":"R4LDZ ✅","12":"David M.","13":"JRN","14":"chad e.","15":"ChiTim","16":"Abraham B","17":"Doug","18":"Stuart","19":"Macpoppy","20":"Conman956","21":"Anon","22":"Jim K","23":"Ernesto Morales Ramos","24":"Barplatt","25":"Marcos","26":"Silverface","27":"Timothy A. Reddy","28":"Andrew Helwer","29":"OneQuartLow","30":"Lance Dolan","31":"Amazon Customer","32":"martha hall","33":"G. Holagunda","34":"Aleksvndr","35":"G. Clement","36":"Joseph","37":"Amazon Customer","38":"Gummy Bear","39":"Pravp","40":"M. JEFFREY MCMAHON","41":"john p","42":"Mark C. Stevens","43":"Arthur May","44":"Trevor Hedden","45":"Erin","46":"PM","47":"Senior Couple in Tampa","48":"Andrew S Davis","49":"Jake","50":"JI","51":"Craig Burdett","52":"Jay F. Grissom","53":"Albert Alpha","54":"Jonathan Mérel","55":"Doctor English","56":"Fernando M.","57":"Mark","58":"Dave and Anne","59":"Amazon Customer","60":"Paul","61":"Sawyer Burnett","62":"Amazon Customer","63":"Alex","64":"yyyycucumber","65":"Kimberly Grabinski","66":"John S.","67":"Lowrider","68":"Jeremy M.","69":"Ashley","70":"BostonTech99","71":"Reader","72":"Tony A.","73":"Phil","74":"Alan Sardon","75":"RUSSELL GORIS","76":"George Snelling","77":"Sam","78":"John","79":"Haz"},"content":{"0":"This monitor looks great for anyone who uses a MacBook and wants that retina “feel”. I used the monitor for about 6 months before changing to another one. This monitor always had a noticeable input lag with any device I used on my MacBook. Tried everything from switching peripherals to different computers and it was still there. I ultimately bought a different monitor and it fixed the issue. I’m not sure if it’s just mine, but beware that it may feel slower than other monitors, however, it does look amazing at the end of the day.","1":"Okay, so I'm not proud of that title but let's move on. Like others here, I've gotten spoiled by Apple retina displays. But I wanted something to use with my PC that wouldn't make me feel just sad compared with my 5K iMac. First I bought a 32 inch LG 4K monitor. LOVE the huge size....but my eyes don't love the resolution as much. Then I bought a 27 inch Dell 4K. Getting better. There would have been a time I would have been amazed by this screen--before I had experienced retina. So finally I realized I was going to have to sacrifice size and get this. Yep, this does the trick. It's surprising, but even with my lousy vision you really can see the difference between 140 ppi, 163 ppi, and this monitor's 186 ppi. My eyes feel like they are on vacation with this whereas the other monitors still make them go to work.Sadly......everyone in the PC world seems to have adopted a bigger is better mentality. There are tons of 27, 28, 32 and even 43 inch 4K monitors, but as far as I can tell this may be the ONLY 24 inch 4K monitor currently in production. It's about quality, not quantity, people. People on the Mac side understand this---but maybe only because Apple has gone out of their way to educate people since the iPhone 4 introduced retina displays.In fact, I'm almost worried something will happen to this monitor and it will be hard to replace because all 24 inch 4K monitors will have been discontinued.Now if you work a lot with photos and video, maybe you will want something bigger. But if you are a writer, this is a dream. You can always adjust font size if you want bigger. But the sharpness of the text will more than make up for the smaller size.","2":"I was looking for a compact, 4K monitor for my work. This is exactly what I was looking for.","3":"Finding a good 4k monitor that is sub 27\" is very difficult and this fit the bill. Its refresh rate is low, but that's the only con I have for it.","4":"I don't know why there are so limited 4K 24-inch monitor among manufactures. 27-inch is too big to place on my desk.... Seems like currently only Apple try to make high resolution monitor with small size. But you know Apple's price...Currently I only find there are 3 4K 24-inch monitor. Two for LG, and one for Dell. Two of them are $600+, still too expensive. And this screen is only $300+, so may be the only choice if you want to spend less money to have a 4K 24-inch screen.Back to the review, this monitor is quite good with high quality. Although it is 2017 product, it still works pretty well. Really a big difference if you use 4k monitor with small screen to read texts and do work. Truely enjoyable.","5":"The thing goes into sleep mode after 30 seconds and it causes a lot of problems when trying to boot up.  Like you turn on monitor and then you only have 30 seconds to turn on computer and get it past POST.Switches to different hdmi ports too whenever you unplug one.It looks really good the software could use some fine tuning.","6":"I think this is the only inexpensive 24\" 4K monitor, so I thank LG for continuing to make it, but there are some annoying things.1. The base: the c-shaped base takes up way more desk space than it needs to.  I have a 24\" Viewsonic monitor that takes up much less space. You also can't put things on the base because it isn't flat, so you might lose some desk space if you replace a monitor with this LG.2. The on-screen display: every time the monitor wakes up from being asleep, the LG on screen display wants to show itself and tell me that the beeping is set to normal and the accommodations are off, and this display stays on the screen for 10-15 seconds so I have to wait to start using the PC.3. The power light: after I shut down my PC, the LG monitor power light wants to flash every couple of seconds--very annoying if the monitor is in your bedroom and you're trying to sleep.  I put a piece of black electric tape over it.","7":"Couldn't be happier with the choice of this monitor. Had searched around for something in this size, resolution and price range for some time. Was coming up short with options. When this went on special at Amazon Warehouse, with an additional discount, I jumped. I'm glad I did.YMMV, but for my particular needs: a home audio recording space, mounting on a VIVO Pneumatic Wall Mount Arm (ASIN: B0779BHZCG), to use in a variety of positions (standing, seated, 90º, etc), this works like a charm. Running off a 15\" fully loaded mid-2015 MBP via Thunderbolt 2 to display port, the LG resolution holds its own with the MBP Apple Retina display. If you want to daisy chain Thunderbolt 3 devices through your monitor, look elsewhere. But for my config it fits the bill.I originally tried to save money purchasing an Asus HD 1080p gaming monitor (ASIN: B083FMP35T), which I promptly returned. Text and overall image quality was too pixelated, and I felt I needed to try a 4K monitor before I landed on something.I can't speak for the stand, as mine is VESA mounted. Seeing how thin bezels are on newer models, I was concerned this might be a bit beefy, but considering how much I move the monitor to different positions, I'm glad it's got a bit to grab on to. I also don't use the audio jack on the back, as I run everything through an audio interface, but I can confirm it works.I keep marveling over the image quality and what a perfect fit it is for my space, I felt compelled to finally write a review on this and share my experience. Hope it helps someone.UPDATE: Only negative I’ve found for my setup and use in VO, is that the refresh rate appears too slow to render looping\/dubbing text clearly when using rythmo band.","8":"This monitor is almost 6 years old, so that is why I’m giving it a 5 out 6 stars. This is old technology and may not be compatible today.","9":"There are a few things really important to me in a monitor and this one ticks all the boxes, I'm primarily looking for:1. Retina resolution (because once you've had it you can never go back)2. 100% Mac compatibility (I'm driving this off a 2021 M1 MacBook)3. No less than 60hz refresh rate.I'm not a gamer so I can't really talk to that, I use this for coding, biz productivity, occasional video playing, video conferencing, you get the idea. If you need crazy response at 4k or 1080p keep on going, this one isn't for you.I got heck of a Prime Day deal on this, it was 'refreshed' but still had the sticky plastic on it — looks brand new, and was a hair under two hundred bucks. I can't say that I've ever spent better money and even at $299 as it is at the time of writing this I'd buy it. The colours are great, it's bright, the blacks and greys are where you would want them, and it has a solid feel to it.You are going to want to use the DisplayPort connection as most newish Macs will drive it at 60hz. HDMI can be tweaked apparently (monitor settings > Menu > Picture > Game Adjust > Response Time: High) to get 60Hz but it would never go over 30 for me — feels laggy and the mouse movement doesn't have the smoothness you're probably used to.I went through a few monitors and this is the one that works great for my needs. Hope you find this useful and give it a spin if yours are the same.","10":"I had a monitor with my old iMac that was just fine. When I got a new M1 iMac with a 4.5k display, the monitor looked dull. I shopped around and saw Apple recommended an LG monitor with a Thunderbolt connector that was expensive. This model seemed to have the same specs without the Thunderbolt connector for much less. I bought it and used a HDMI to USB-C connector. It was sharp and crisp, but it was only running at 30Hz which made it a little jumpy. I got a Display port to USB-C cable and now it runs at 60Hz, looks great, no jitters. Highly recommend, but if possible use the Display port.","11":"I bought this monitor for my home office.  I am also a gamer, but I never intended to use this for gaming.  I needed an extra screen real estate to accommodate multiple windows open and browsers.  This 4K monitor has enough pixel resolution to have 2 windows side by side, yet the texts are big enough to read for me.  My main monitor is a 34 inch ultrawide with 144Hz refresh rate and Freesync which I use for gaming.  I will not play video games on this LG monitor because once you get used to 144Hz refresh rate, it feels sluggish playing on a 60Hz monitor.  The colors on this LG monitor is great for daily use and media consumption, but I won't recommend professional photo or video editing on this monitor as there are more to be desired for when it comes to color accuracy.  One thing I like about this monitor is the matte screen, it prevents reflections and glare, so I don't have any problem whatever the angle of the light is in my home office.  Overall, I love this monitor for office use and a little media consumption, I will only deduct 1 star because the display quality is not as brilliant as the other monitors I have.","12":"This is a great monitor for the price. I usually try to be a value shopper, and I'm proud of this purchase. This monitor was about $100 less expensive than I paid for a normal HD monitor about 5 years ago! I'm replacing an HD Asus monitor, and wow! Finally, finally, I have a monitor that actually looks good beside my 15 inch Macbook Pro Retina Display. One thing I love about the Retina display is that text and photos look like high resolution print: incredibly smooth with no noticeable pixelation at a standard viewing distance of > 1 foot. This LG monitor also does this! But one thing to watch out for: You need to turn OFF \"SUPER RESOLUTION+\" (Menu > Picture > Picture Adjust). Otherwise, there will be noticeable pixelation rather than the smooth lines you expect from a retina-like monitor. I think this setting was added as a quick-and-foolish way to increase sharpness and contrast in one preset, but it really fails in that it is completely unnecessary (since you also have a separate sharpness and contrast settings) and it does more harm than good.Speaking of settings, here's what looks best for me: Brightness: 100, Contrast: 70, Sharpness: 50, Black Level: Low, Deep Color: Off, DFC: On, Response Time: High, Black Stabilizer: 50, Gamma: Gamma1, Color Temp: Warm or Custom, Red: 50, Blue: 50, Green: 50. I also made the Gamma slightly darker using my Mac's display profile. My only gripe is that the peak brightness is slightly less than for my MBP retina display, but it works out since I usually have my retina display at -1 or -2 peak brightness, which matches the LG monitor. The default contrast of 70 seems optimal, as midtones appear to exponentially disappear above 70, while linearly decreasing up to 70. The default sharpness of 50 also appears to be native, and there really is no reason to change this setting higher than 60. Sharper and aliasing becomes noticeable, and lower and it actually looks like the monitor is adding blur. A low black level looks best, and higher ones just look washed out. Deep color didn't work for me, so I had to keep it off. I turned on DFC (digital fine contrast), but I didn't really notice any difference with it on. I also didn't see a difference with a high response time, but I have it that way just in case.In short: If you're looking to upgrade your existing monitor with a super high-resolution, value monitor, then get this one. Great for Macs! Just turn off Super Resolution, and keep the rest of the settings at default.","13":"This review is for the 24\" model. I bought this monitor for photo editing and occasional gaming.Highs: Price, screen brightness, high DPI, construction, OSDFirst off, this monitor is inexpensive for what you get. You get a relatively high DPI, an IPS panel, and supposedly nearly full sRGB coverage. This is not an HDR monitor, but the backlights are sufficiently bright at well under 100% brightness. This means there is some headroom to bump up the brightness as the LEDs slowly dim over the years. My monitor did not have any dead pixels.The stand does has only a tilt adjustment, but the monitor seems to be solidly constructed overall. There is a sense of quality to it. The plastic enclosures of some monitors creak when you pick them up. That doesn't happen with this one. The OSD is also very well designed and easy to use. You navigate it using a single button which is basically a directional pad. I wish all monitors used this setup.Lows: Uniformity, contrastMy monitor has noticeable hot spots at the top and bottom edges of the screen. These are actual hot spots, not IPS glow, which is also present. They are not terrible, and they don't stick out in real-world use. There also seems to be a lack of color uniformity across the screen. The right side, in particular, seems to have a slightly greenish cast. It's difficult to tell how much of it is from off-angle viewing. Again, it is a mild problem.Regarding contrast, black levels are somewhat bright, and there is IPS glow in the corners. Contrast is definitely not a strength of this monitor, though I would say that it's still acceptable.Bottom line:I think this monitor provides a lot of value. The build quality was beyond what I expected for the price, and everything else is acceptable. If you are looking for an affordable high-DPI monitor, I think this is worth considering.","14":"Although it is very nice, if you are purchasing for multiple computers to use same monitor, they could have made this function simpler in my opinion. Doesn’t take away from the fact that it is a very nice monitor for the money, just realize you may have difficulty getting it to work in that regard.","15":"Initial impression. This review is ONLY after one day, so take it with some reservation. I'll try and update it a few months from now. I bought the 24 inch version. The OEM box (inside a typical huge Amazon box) was remarkably small and light. Everything packed well. Comes with both HGMI and DisplayPort cables. MacBook user beware if your laptop uses the mini-DP Thunderbolt ports you will need an adapter. Also comes with a CD, but it was easier to just go to LG's website and download the manual in PDF. The stand looks tedious, but it actually was quite easy to assemble. You will need a Phillips screwdriver. It also has a convenient cable clip to gather the cables together. I found it to be a little short for my desk and chair hight, so you may want to place the stand on a another small monitor stand.I connected my MacBook Pro 13 (2005) via DisplayPort, an older Sony laptop via HDMI and an Amazon FireStick via HDMI. On boot up, it recognized all three devices without changing any configurations. MacOS does recognize the monitor and loaded the correct config file. It does support the maximum \"scaled\" resolution (4K) that my MacBook supports, however I cannot read anything that small on a 24 inch monitor, so have it backed off by two settings. This is an Apple issue, not a monitor issue, as Apple still will not support global font size adjustments like Windows does. However I have tested 4K Youtube videos using a 4K-capable web browser (Chrome) and Vimeo 4k videos and they play fine. There can be some lagging at the highest setting, but that's because despite supporting 4K, my graphics card in the Mac is still not able to fully support 4K as Apple claims. The Sony running Windows supports its max resolution just fine, which is 2K. The 1080p Amazon FireStick works fine with both Prime Video and SlingTV. The setup button is a bit annoying, being a joystick button located under the bottom of the monitor. It's taking a bit of getting used to. I do not use the built-in sound (I use BT speakers connected directly to my laptops and the FireStick) so I cannot comment on audio. Over the next few weeks I'll play with the settings and calibration and update this as needed.","16":"Many other 4K monitors require too much fiddling around to match Mac OS Retina resolution well. This monitor offers near-Mac resolution out of the box. But there are some caveats you should know.First, if you do a lot of late night computing like me, know that the monitor's \"brightness\" control is very narrow. Worse, even when set to 0, it stays very bright--too bright for a dark room to my eyes.Next, the advertised split screen software (download from LG website) is no longer offered. This monitor is only a few years old, but LG has already taken away a critical option that prompted many of us (Google complaints) to buy the monitor--ability to set up distinct workspaces on the one monitor.For some, this is a minor complain, but more and more of us are wary of companies demanding we divulge our identities and sign (anti-) privacy agreements JUST to reach out to the company. Go on LG's website, enter this monitor's model number, and search for software. You get a \"not found\" error message. Then, try reaching out to LG customer support. First, you MUST sign a privacy agreement allowing LG to record personally identifying data, including your IP address and your machine's unique identifiers. And LG retains the right to do with the data what they deem appropriate. We've already bought their product, but we have to gift them our private data in perpetuity, too? That's going too far. But how do you, otherwise, get the company to service their machine (warranty...)?If this weren't one of the only reasonably affordable monitors doing a decent job of matching Mac's Retina resolution out of the box, I'd return it.","17":"I'm pleased with this monitor, good value for the $.  Problematic for me is the plugs go straight out the back  making getting it close to a wall impossible; vs monitors that plug in from the bottom up.","18":"I've been using this monitor for a few weeks now, and I'm very happy with it. The 24\" screen is clear and detailed, and the backlighting is even. It works flawlessly with my Late 2013 MacBook Pro.The monitor comes with HDMI and DisplayPort cables, but since my MacBook Pro needs a mini-DisplayPort cable I also bought the \nStarTech.com 1m 3 ft White Mini DisplayPort to DisplayPort 1.2 Adapter Cable M\/M - DisplayPort 4k with HBR2 support - Mini DP to DP Cable\n. In retrospect, I should have bought the black version of that cable to match the back of the monitor, but the cable has worked great.Out of the box, colors were a little washed out at first. Pastel colors were almost white. But after going through Apple's calibration process (System Preferences > Displays > Color > (Option-click) Calibrate... > Expert Mode) the display is richly colored and a perfect match to the built-in display on my MacBook Pro. I also had to change my sound output preferences to use the MacBook Pro's built-in speakers, since this monitor does not have it's own speakers.The 24\" size is very comfortable on my desk — about 4\" wider than a full-sized keyboard — and a perfect size to get retina resolution at 3840 x 2160.I also use the display with Windows 10 in Boot Camp to play games, and it works well there, too. I occasionally have a problem where the monitor comes up black out of sleep, but Alt-tabbing to another window (for some reason) wakes up the display and everything is fine. I think this is a problem with Windows rather than the display.I like the little upside-down joystick button on the bottom of the monitor for changing monitor settings. I find it easier to use than the multi-button setups on other monitors, and the on-screen overlay makes it clear how to navigate the menus. Good design.The stand is adequate for my needs, though you can only change the angle, not the height. The stand is a little bouncy, which might be annoying if your desk shakes, but my desk is stable enough that it hasn't been a problem.Overall, I am very happy with this monitor as a no-frills beautifully clear display for programming and occasional gaming.","19":"This reasonably priced 4k monitor screen has made a huge difference in comfort and productivity in my work.  But, I wish the base were adjustable.","20":"Works Great","21":"I purchased this monitor for around $260 out of the door right before Thanksgiving. For a 2160p monitor, it is totally worth the price. However, since I don't have an AMD GPU, FreeSync is completely pointless for me. Additionally, the response rate on this monitor is pretty bad for high intensityor FPS gameplay. But when you have an IPS monitor, that should be expected.Where this monitor shines (literally) is in the color and picture quality department. 4K images, games, and movies look phenomenal on this high PPI (pixels per inch) display. You can color correct this monitor down to six parameters (colors). Setting up with my PS4 Pro was a little confusing at first. You must enable \"HDMI ULTRA HD Deep Color\" in the Picture settings of the monitor. On the other hand, setting up games on my desktop was a breeze. Nvidia drivers automatically changed my resolution for games and adjusted quality settings for the best experience on my 1080 Ti. Games such as GTA V and HITMAN ran buttery smooth in 2160p60Hz and look absolutely stunning! However, other games that did not have 4K textures or optimization had a better experience for me on 1080p144Hz. Upscaling the resolution for games that don't have 4K textures is not worth it, in my opinion.I will admit LG's displays aren't the best. There is some backlight bleeding on the edges of the screen as some people have pointed out. It becomes a bit of an annoyance initially, but after you get used to it, it is hardly noticeable.Another con is that this monitor is not very good for web browsing. The high PPI makes text not seem crisp. You must increase text scaling if you want text that is clear let alone large enough to read. This is not this particular monitor's fault but rather the fault of Windows 10 and HTML scaling for 24 inch 4K monitors - just something you should know before purchasing.Since I am coming from a 1080p 144Hz set up, getting used to this monitor's low response time and refresh rate will take some time for me. Can't wait for 2160p 144Hz displays though!","22":"Bought this monitor for my wife for working from home.  She has a smaller desk, so we wanted a 24\" or smaller monitor.  After trying a 1080p monitor and hating how pixelated everything looked, we looked for something with higher resolution.  It is surprisingly difficult to find a 24\" monitor with higher resolution than 1080p, so after searching for a while we decided to give this 4k version a shot.  Overall very happy, picture quality and resolution is great.  However the colors are a bit washed out and this monitor is not as vivid as I would expect.  It may take some calibration of the color settings, but the out of the box settings are definitely not too impressive.Build quality is fine, glossy piano black finish which I'm sure will accumulate plenty of dust and fingerprints over time.  As with most LG monitors, the stand is a bit wobbly.  Overall very happy with the purchase, the monitor market is a bit overwhelming so if you are looking for a high-res WFH monitor, this one is a great option.","23":"I've had a 1920 x 1080 24\" LG monitor for years as my main external monitor for editing on my MacBook Pro 16\" (latest model). Lately the menus on Final Cut Pro were losing detail and opted to get this 4K version. Same size, shape, everything except the inputs and power supply. The cord plugs directly into the back with no brick adapter and this one has HDMI and DisplayPort, no VGA or DVI like the 2K version.I DID read the reviews and got a USB C to DisplayPort cable from Amazon to go with it and when I plugged my MacBook to the monitor, VOILA! - instant, crystal-clear image, sharp, colors almost identical to my laptop's - flawless.At one point I moved the monitor around on the desk and I got a warning message on its screen about \"using the included cables\" that came in the box - HDMI or DisplayPort - but, obviously, there are none of those outputs on the MacBook Pro so you have to use a cable like I am or get a dongle.CONCLUSION: VERY HAPPY WITH MY PURCHASE! Only time will tell if it is as reliable as my original LG.","24":"Like many other have mentioned, this monitor has some issues waking up from sleep and also from a cold start  if connected to a Mac. Others have mentioned the issue affecting the display port. (I haven't tried that myself.)  I am using the supplied HDMI cable and it is a frustrating mess switching (via the toggle on the monitor) from a work PC to my Mac mini. I thought I had figured it out by attaching a wired mouse and clicking like a madman as immediately after switching port. But that's a hit or miss. I have had more luck shutting everything down (via a surge protecter) and then turn on the Mac. Basically a cold boot.I got this when my fancier LG monitor died (the one Apple sold and only has thunderbolt port). And there really isn't much to chose from if you want a smaller monitor with a \"4K\" resolution. Image quality is OK. Not the best colors but I enjoy the fact that this doesn't have a shiny surface. Also being a smaller size, UI elements and text (when properly scaled) look sharp.Oh, and just to clarify, I have never had any issues when switching over to my work Windows PC (even though it warns you that you are not using the supplied cable).","25":"24\" @  4K as it should be! The windows world is clueless about the joy of high-dpi \/ high pixel density monitors, but thankfully this very affordable 4K 24\" monitor is perfect for a Mac Mini or a Mac laptop. Not fancy Thunderbolt hub or anything, very utilitarian but over display port or HDMI, it does 4K @ 60hz.I'm using it with a Dell laptop for work (over Displayport) and a M1 Mac Mini (over HDMI). Both work well, Mac OS of course is smarter about high-dpi, but it looks like a Mac monitor should.USB ports etc would be nice but for $299 this is great.","26":"IMO this is an outstanding monitor for use with a 2017 MacBook Pro.  Please note that it must be connected with an USB-c to Displayport adapter (I bought the highly-rated Monoprice one) and a Displayport cable, to the Displayport on the monitor to get 4k\/60hz.  If connected by HDMI it will only do 4k\/30hz (some much more expensive monitors will do 4k\/60hz via HDMI).Do NOT confuse things with \"Mini DisplayPort\" - that interface is not used on the monitor OR new MBP, which comes with 2 or 4 USB-C\/HDMI\/Displayport ports.  I initially thought the lack of other ports on the MBP (it has NO other ports!) would be a hassle - but it's not.  And the ports are VERY secure - the cables\/adapters snap into place and simply don't fall out.The monitor was detected immediately once connected and powered up.  NOTE - the power switch is almost impossible to find without reading the instructions!  And because it's also a joystick I won't point out its location - the instructions are important.  It works immediately and you will probably be notified of a firmware update - install it right away and the \"Displays\" setup will change to reflect it.  It handles 4K\/60hz without any special setup.I have no problem with \"leakage\" - but as that is only something that shows when a monitor is on but not used I don't see the point of worrying about it anyway.  The screen is crystal-clear, it refreshes fast, and it's great for having two (or more) windows open at a time.  I suppose there may be some users that need a more expensive 4k monitor for some reasons, but I have no idea what those reasons would be.  I've surfed the web, watched 4K video, edited RAW images and HD videos, and used Logic X for some studio recording and I fail to find anything the monitor could do better!Highly recommended.","27":"This is the perfect budget monitor for a Mac Mini M1.  The pixel density makes this monitor feel like I'm looking at a modern iPad's screen.  I'm completely happy with the brightness, color and overall clarity of the picture especially text.","28":"For the price, this monitor is absolutely unbeatable at one thing: displaying text! A 4k monitor is basically four 1080p monitors glued together. So if you buy a 4k monitor then run your OS at 2x zoom, it's like having a single very, very nice 1080p monitor. Everything looks crisp and beautiful; all the jagged edges you can see on text on 1080p monitors are just gone. Unfortunately, most 4k monitors are huge and expensive; this one is regular-sized and cheap! I bought two to replace a dual-monitor 1080p setup for my home office. So far I love it!The monitor doesn't support high dynamic range (HDR) or wide color gamut (WCG) but I don't really need that. Its 60 Hz refresh rate is also pedestrian by modern gaming monitor standards, but again this doesn't make much of a difference for general office & programming work (or the occasional single-player video game!). The only thing I would change about this monitor is to have a second DisplayPort input instead of a second HDMI port. I think this has to do with the monitor's FreeSync implementation.All in all, best value 4k monitor on the market right now.","29":"4k resolution at 24\" seems ridiculous until you consider the pixels-per-inch of this monitor is still 10-15% lower than an Apple retina display.  I use it as a 2nd monitor in a fairly dark room and I have the brightness lowered accordingly.  I don't notice any light bleed and the contrast seems every bit as good as the VA panel I use as my primary monitor.  Maybe this is a mediocre IPS panel by today's standards but I think it's rich and beautiful.  I have Windows set for 200% display scaling and there are no difficulties with any of my apps, both old and modern.","30":"I researched long and hard. Though this monitor still hasn't proven itself to me on all levels, as I've only had it couple weeks, these are some things I know: - Might have LAG when you first get it!I use this for gaming primarily and the input lag was so bad that all games were unplayable. It was like putting your hand in mud and trying to move it around. I used humanbenchmark.com to test and found my results to be ~150ms slower on this monitor compared to my other monitors. That's A LOT, and it's BAD. However, I monkeyed with the settings, turning off all the special features, and used the NVIDIA Experience software to play some advanced settings. I honestly don't know which setting fixed the lag, but the response time improved by ~180ms, meaning that it now responds even faster than my old monitor. One theory of mine is that initial settings might have been using my PC GPU to scale-up resolution instead of the monitor's on board processor. - IT'S FRICKEN GORGEOUSMy rule of thumb is to spend tedious hours researching color depth, response time, and various other metrics while shopping, but then throw that all out the window when the monitor arrives and just ask myself, \"How nice is this?\" And the answer is I'm astonished. I'm afraid to admit I might prefer it to my brand new macbook retina display. COLORS ARE BRIGHT, details are sharp.I'm docking 1 star only because I spent a solid 4 hours troubleshooting the input lag between the first 2 nights I owned it. Less technically oriented users might have been forced to return the thing, or perhaps settle for an inexplicably dissatisfying experience.","31":"My journey began with an LG monitor from Apple with similar capabilities, 3x the price, and a day spent in frustration over the choice to leave out any computer without usb-c capabilities.After returning that mistake, I tracked down the LG brand and was delighted to discover that monitors of comparable (if not exact) image quality existed for a fraction of the cost and without Apple's built-in technological exclusivity.I just unboxed and set up my new LG monitor. The color perfectly matches my Macbook Pro screen, there's zero pixelation or grain in the image no matter how close I stick my eyeballs, and the 24in size feels perfect at my desk. I look forward to spending many hours getting use out of this thing as a professional writer and portrait photographer! (And spending that extra would-be Apple money on something else!)","32":"It was the wrong one nothing is wrong with this one it’s just not the one my grandson wanted. Thank you for letting me send it back.","33":"Delivery - Per the committed dateShipping - Box is intact and no excessive dirt or dingsMonitor - Clearly an unopened box as I had to tear through all the packaging and the covers. The sticky tapes to the monitor parts are all intact. Very easy intuitive installation. I received two cables (HDMI and Display Port). I do not know if they are newer cables or not. I am able to use DP1.2 on my monitor though without any flicker. I do not see any color imperfections in the corners. It is bright and well lit, so I have to reduce the brightness and increase contrast. When the signal from the computer is removed, it has a brief period of time of bleeding, however it soon enters into power save mode and it does not bother me. I like the way that I can control the LED on and off for the monitor. I thought a 24\" may be small but for my visual field, I could actually only see about 3\/4 of the monitor in focus, so glad that I did not buy into a 27\" monitor. I can get my old laptop with Intel HD Graphics card upgraded with a newer driver (Provided by Lenovo), This shows complete resolution at 4K (3840X2160) @ 60Hz on DP and I could reduce it to other resolutions as I wish (2560X1440; 2048X1536; 2048X1152;1920X1200; 1920X1080 etc.,).The monitor can tilt up with the provided stand however it would not rotate left or right.Cons:  Only issue I have with is that I cannot tilt the monitor down.","34":"Fits perfect if you work with multiple windows","35":"I was concerned about buying such a low cost monitor but it’s VERY good. Crisp and clear and the size is great. I can have my music notation tools all open on the same screen and it improved my productivity tenfold.I’m not a PC gamer at all so I can’t account for the graphics for a gaming PC, but I have a Nintendo Switch and a Wii (For GameCube games) hooked  up to it. Switch games look fantastic on this screen. Even Virtual Console games like Star Fox 2 look great. Nothing is blown up or stretched.The screen did need some adjustments for the Wii, however. Keep in mind that the Wii outputs at most 480p. The games still look great however, a little blurry. Still not stretched though which is great. I use a 3rd party Wii HDMI adapter does that does affect the display quality.No speakers is disappointed but the 3.5 mm audio jack in the backside is a very convenient exchange.","36":"this has been a great monitor been using it for four years and out of no were I got screen burn in. So now when I do anything on the top if I focus I can see a browser tab bar. lol Still great monitor","37":"I Bought 2 of these monitors a few years back for a work setup, (With a MacBook pro 13\" with retina) and have since transferred them to 2 separate setups and added an additional monitor. I'm about to buy my 4th, as the current generation of MacBooks can support 4 externals. These monitors are great. They closely match the MacBook in resolution and color, so nothing is jarring when moving applications screen to screen, and unlike other monitors I've had in the past, I have yet to have any dead pixels or the like.Also has some display port input on the back so that in my WFH setup they can double as my PC monitors when I'm not working. Very Solid.","38":"LG 24 inch flat monitor with UHD is far better than any FHD. Just perfect! I have two of these LG models, and once you start using UHD, there is no going back to FHD. It has no speakers, but has a jack for headphones; I use it in my home-office where sharp images are needed for engineering work rather than speakers. The size is also just about right for my smaller desk. Has no UBS-C port, but has 2 HDMI ports and a Display Port. However, I think the mechanical ON\/OFF knob at the bottom, which also swivells for Menu options, could have been made sturdier with a better design.","39":"Excellent product.. fonts are very crisp and videos are ultimate . Tried 27 and 32 inch 4K monitors but the font is very cris. I would recommend to go with 24 inch 4K or 27 inch with higher PPI.","40":"I was surprised at how small this 24-inch was out of the box. It even felt light compared to my old iMac. I've got this monitor on an elevated platform of about 6 inches. I've connected this LG monitor to a docking station with the station and all the cords hidden inside a giant cable management box. The monitor is hooked to my Acer Predator Triton 500 laptop. To enjoy crisp reading without squinting, I went into Google Chrome and changed font from 100% to 150% so I don't have to hit command + for every webpage I go on. At this price point, the IPS 4K is excellent, bright with no bleeding at the corners. There is hardly any bezel around the frame so the monitor looks very clean and modern. My wife said during \"The Long Night\" episode of The Game of Thrones the picture was too dark, so I may have to see if I can change the default settings, but otherwise, the images are excellent. Recommended.","41":"I purchased this monitor to use with my dvr security camera setup.. it totally looks amazing and the details just pop..Would buy another to use on my pc next..","42":"I bought this as a monitor that I could use with both my Mac or work computer while working from home. I wanted cables to be able to go from the work PC to a Mac Book pro to an iPad Pro with no hassles. It was really that simple! All I had to do was find the right cable to go from a work computer to one HDMI and while using a USB-C to a display cable for my MacBook Pro. Or using USB-C to HDMI for my iPad Pro. Set up was quite simple and very quick!","43":"Very nice little IPS monitor for the price especially if you have a FreeSync (AMD) card.","44":"This LG monitor is sharp and very quick to power off and on compared to my old Samsung monitor that I formerly had. I run Linux and had no problems with setup. I hooked up the physical cords, switched my screen's desktop pixel size and... that's it. No drivers to install, no setup CD\/DVD - it just works.  The only negative thing I can think of to note is that the setup button is a bit too responsive and may take me a couple tries occasionally to switch HDMI inputs. Even then, that may just be me.","45":"Overall the monitor is great.  I have it connected to a Macbook Pro (Retina, 15-inch, Mid 2015) and get full 4k resolution, which requires an adapter though.  I have noticed a great deal of lag when in 4k resolution when editing audio in GarageBand, other than that I haven't noticed it doing anything else.  I'm not sure if it's my computer, the monitor, or having to use a display port adaptor.I also have my Xbox One S and PS4 Slim connect as well.  On the Xbox One S, 4k resolution is fully supported.  On the PS4 Slim, on the other hand, does not support 4k resolution even though 4k is supported for the OS and video (YouTube, movies, Hulu, etc...).I'm not exactly sure why the Xbox is able to display at 4k and not the PS4 Pro.","46":"I'm a software engineer and I need really good quality text. After working on a macbook exclusively for a while, I thought a 24\" HD monitor will do. I ordered one and the moment I got it I realized it's not going to be good enough. So I ordered this monitor and the picture quality is amazing! I really don't see why I'd need anything better. I'm not into big monitors where I have to juggle different things - I want to be able to see only one thing on the screen so that I'm not distracted visually. The only downside of this monitor is that the bezel is a little bit glossy, but you don't really notice this. It's a pleasure to work on this monitor.","47":"Excellent screen, no bad pixels. It's very bright and clear, wonderful color. I replaced two old 21\" 1600x1200 monitors with this in a three monitor setup - now two. Realize that whatever computer you're running from - it needs to handle 4K, and that isn't a given even with new video cards. Windows 10 will recommend a scale of 150% for all windows. This greatly reduces the size of the available desktop. I tried 125% and pretty much liked it, but 125% and 150% both caused problems on the second monitor. The second monitor was scaling also even though Windows setting was for the one. This causes windows to appear cut off on the bottom and right sides on the secondary monitor.  Researching on Microsoft websites I found the exact problem described when a 4K screen was in a multi-screen setup joined with a lower resolution screen, and there is no solution for this. This prompted me to set all screens at 100%. But believe me, it takes a lot of getting used to and in my case a good set of computer glasses.I've decided to replace my older monitor with a new LG 24\" 4K version of this one. I need it set in portrait, and the bases will not allow rotation. A new base will be necessary.","48":"I purchased this monitor to complement my 2017 MacBook Pro, and I highly recommend it.Once purchasing the necessary USB to DisplayPort Mini cable (about $15 on Amazon), setup was seamless and required absolutely no fiddling or work - plug and play (when I connected, it took about 20 seconds to get a signal... I have a theory that the Mac download a driver quickly). And boom, perfect.I'm using the monitor for music production and to vastly reduce neckstrain during long sessions. I've included some photos to see what it looks like with my Mac on a 4 foot wide desk.DOWNSIDES YOU SHOULD KNOW ABOUT if you have a Mac: Firstly, this monitor will not provide power to the laptop. So you'll need to keep the laptop plugged in to the charger, and then use another of your 4 USB ports as an output to the monitor, leaving just two more for other tools. I use a third for my audio interface and the fourth for a keyboard, but if your studio has more widgets you'll need a hub, which is the other downside - this monitor is not a hub. However, if you go into this whole thing expecting a great monitor, you will be delighted.","49":"No fault of the monitor, but Windows 10 still has no concept of good scaling. Some things looked extremely tiny, others very pixely, computer ran alot hotter\/harder\/slower (probably because my hardware is a little dated for 4K). The stuff that was optimized for 4K looked mindblowingly clear!I ended up returning this monitor and going back to my old 19in 1366x768 display because Windows and most apps seem to be created with this resolution in mind rather than 4K. It just seems like the PC industry isn't ready for full 4K yet. Shame.I'm giving the monitor itself a 5 star rating. But that's not taking into consideration the poor compatibility with existing Windows applications.","50":"The menu 'joystick' at bottom center needs to be clear, but having figured that out I very much like the fact that adjustment menus are available so directly. The higher resolution works much better with the typical Mac in an extended monitor setup than a 1080 monitor. The cursor moves smoothly from laptop monitor to external. What doesn't work is using alongside a 1080 monitor in a multimonitor setup.","51":"I purchased this as a second monitor for my Mac mini and ordered a USBC to Display Port cable. Plugged it in and it worked fine. But every time the Mini went to sleep (every. single. time.) the monitors refused to turn on and the machine required a hard reboot. (It might work fine going from the old mini-DP ports but I don't have one to test.)Today I found a thread on an Apple forum about the same problem with this monitor (and other LG monitors) on other Mac systems. The solution was to abandon the DP in and either go direct from an HDMI port or use a USBC-to-HDMI cable.I changed to a USBC-to-HDMI input and everything works perfectly.This is a great monitor for the price but the DP is not to be trusted by Mac users.","52":"I used this display to replace a BenQ FP202W 20.1\" monitor that I picked up in 2006 (Yes, it still looks and works great). 11 years! I checked the order online to be sure of when I bought it.This LG monitor is a real bargain. The inputs are minimal (2 HDMI and a Display Port) so it's dead simple to use. There is a little nub on the bottom under the LG logo that pulls up the onscreen controls.The resolution on this is really amazing (which I expected from a 4K). The screen itself is not glossy but not matte either. It's just perfect.The bezels are kept to a minimum and it's light but still sturdy. It's very light too, but not so light that you can't use it with a Desk Mount LCD Arm (I've got this monitor hanging from an LX Desk Mount LCD Arm. It's perfect and looks very cool too!).Overall - when you first get it - this is a DARN good monitor. It's an amazing monitor for the price.I'm hoping it has the same longevity that my old BenQ had. Interestingly. This new LG monitor was about $10 less than the BenQ.It's hard not to be VERY happy with this monitor.","53":"The monitor has an excellent picture. It's an outstanding value for the price.Simple. Does not have USB ports and all sorts of stuff one never use.So why 4 stars instead of 5? The bezel is shiny. Annoying reflections. It would have been perfect if the bezel had a matte finish.I'll keep it though.","54":"Mine came with 5 bad pixels (black), fortunately the pixels on this screen are extremely small, so this is not really bothering.Otherwise the picture quality is excellent. I use it for photography and I may have to calibrate it (it seems a tad greenish).","55":"I have this monitor paired with my iMac retina 5k 27 in. and it's absolutely been perfect. The quality is very similar looking between both monitors. I don't think it's grainy at all, compared to other IPS monitors I've tried. I have a lot of eye problems, too, so the reader view and custom settings I've been able to do make it less harsh by the end of the work day.","56":"I tried a 27” HP before this one because I wanted something really big but it turned out text was blurry when connected to a Mac but it was ok when using ir with windows laptops.After a lot of research I chose this one and wow. Text is exactly as it looks on the MacBook which is clear and crisp.No more visual issues.It is super easy to setup and use. I really love it.","57":"So many 4K monitors are huge, usually from 27” and up. I needed one to take with us in our RV for a family road trip that was high res, had good color representation, and was 24” or less. This one is fantastic. To think that a monitor this good could come on a used deal from Amazon is surprising.","58":"I bought a pair of these for my office - they are fabulous monitors in almost every way.  The ONLY complaint is the base is very basic - no \"up\/down adjust\" - they are totally fixed, and quite huge in footprint.  But that didn't matter much, as I soon mounted the monitors to a dual VESA tree and solved that.Outside of that, for the price, this is a terrific monitor","59":"I had a 25\" monitor that had a native resolution of 2560 x 1440. I loved it since that density makes for a sharp picture. I had stayed away from 4K monitors because I thought that while they would look sharp, the effective resolution would only be 1920 x 1080. I didn't realize that on a Mac (probably PC too), though the sharpest image would be 1920 x 1080, I could run it at any resolution in between that and the native 4K resolution just like I can with my MacBook's retina display. So, I'm running this one at the same resolution as my previous 2560 x 1440 monitor which I find to be a good balance of sharpness and screen real estate. Even though that is not the native resolution of the monitor nor a \"doubled\" resolution, the picture  still looks great due to the sheer pixel density.Anyway, if that is too much technobabble for you... TLDR; amazing picture sharpness, colors and clarity in a pleasingly small, thin and light frame with a thin and stylish bezel.The stand is not very adjustable however so I put it on a VESA monitor arm since it has standard VESA 100mm mounting holes.","60":"At 186 PPI, this monitor does not quite fit Apple's definition of retina, but it gets close enough to satisfy anyone who is looking for a monitor that is more affordable than Apple's or LG's other offerings.","61":"I have a 2 of these set up to hdmi for my desktop pc and display port for my mac.  Unfortunately, these monitors don't have an auto-detect feature so anytime I switch computers, I have to annoying go in and switch the inputs. I thought all monitors already had this feature. To make things worse, it doesn't always immediately detect the input so sometimes I'll have to spend 2-3 minutes switching inputs, turning the monitor off and back on until it finally works correctly. The ports in the back are also not great if you have monitors up close to a wall. Instead of pointing down, they come right out of the back which makes no sense at all.I wanted a budget 4k monitor and I guess I got what I payed for. These are decent for the price, but missing a LOT of features which all monitors should have. I regret getting these monitors.","62":"Great monitor, high quality, very easy to set up. My only complaint preventing this review from being a 5-star rating is that the crescent-shaped stand foot arrived bent (or poorly-cast). It doesn't sit flat on a flat surface. Fortunately, because the monitor is heavy and sits primarily on the rear of the stand where the neck meets the crescent, it doesn't tip or wobble. Therefore I've not returned this monitor for a new one.","63":"I was on the fence about whether to upgrade from a standard monitor to a 4K or not. I am very glad that I did. I think it's pretty unnecessary if you're just casually on the computer, but if it is your profession and daily workstation it is likely worthwhile.One thing you should be very prepared for if you are a Macbook user is ALL THE CABLE WOES. 4k requires special cables, new USB hubs, and vigilant prayer to get it to work.","64":"I remember the first 4k monitor I bought two years ago, it was purchased from Microsoft's website and it was on sale, I spent 250 dollars on that and it turned out to be a complete crap, color accuracy is horrible, the response rate is unacceptable, color contrast is a mess. After 2 years, when i clicked the button to buy this one, I was skeptical, and nervouse, i was afraid things will be the same and i had to go through the trouble to return it.BUT! BUT! it turns out to be amazing! I bought the 24inch version and the PPI is as high as 180, put it side by side with my MacBook pro and you cannot tell a big difference between the two's screens, and the response rate is amazing too! ( you have to use the DisplayPort though, HDMI only gets you 30 and you can really feel the difference ).No other words, 5 star.","65":"This monitor is nothing short of fantastic for the price. The resolution looks as good as my iPad which is what I was looking for because I edit photos for web use and since most web users are using mobile devices, I needed what I was seeing as I was editing to match the end displayed result for the average user. This does it!A couple of things to note - a 24\" monitor at this resolution means very small text. LG does have software, as does windows natively to increase the font size and interface size but some programs such as all of the Adobe programs have trouble with their text menus. You can increase the interface size so your icons and floating tabs are easier to see but in some of the programs the text menus remain small. This is an Adobe issue and will be a problem no matter what, but a larger screen will help that.The PIP and tiled desktop features on the software for this monitor are excellent as well.I highly recommend this monitor!","66":"This monitor is sized perfectly for my use with a Mac mini and it's one of the few monitors that is sized below 27\" that is 4K. The only quirk was that macOS Catalina seems to detect monitor as the 27\" model and not the 24\" although this really isn't a issue since resolution is same. Definitely a step up from my 21.5\" Viewsonic FHD which isn't a bad monitor but I do notice the clarity improvement of higher resolution.","67":"I was looking for a 4K monitor with a 16:10 aspect ratio for my new Mac Pro.  This monitor replaced an HP HD with a 16:10.  With the 16:9 I really miss the lost real estate.  But, from my research I could not find a 16:10?  Seems 16:10 is only available in HD monitors.Also IMHO, the stand is crap.  It's too light and mounts to the monitor too low.  Makes it unsteady and prone to falling over.  However, this monitor has VESA a mounting plate.  My old HP has a much better mount, that was mounted on that monitors VESA plate.  I removed the LG stand and replaced it with the HP stand.  MUCH better.Now, picture quality, IMHO - EXCELLENT.  Bright with good contrast, vivid colors.  Really, a nice display.  If it were only 3840 x 2400 I'd be thrilled.Edit - After owning this thing for three weeks, It's going back.  Over time I became aware off it's serious flaws. Initially  It was better than my previous HP HD.  But as I became more critical, the picture was washed out with very poor contrast.  Very dim.  Small type was hard to read.  I have replaced it with the LG 24MD4KL-B UltraFine 24\" IPS LED 4K UHD Monitor for Mac.  Amazon has a smokin' deal on it right now.  The listing says renewed, but I don't believe it.  I believe it's brand new without the LG warranty.  I needed a special BiDirectional cable to hook it up to the DisplayPort on my Aorus RW5700XT.  The monitor display as absolutely gorgeous!  It's bright and clear.  Excellent contrast and small type is now sharp and clear.  The LG Mac monitor is stunning.  This one, Not So Much.  I guess it's true - you get what you pay for.","68":"I couldn't be any happier with these monitors. I'm using 2 with a MacBook Pro 2017 and the picture quality is amazing. After some research I found the pixel density of 4k at 24 inches is the closest equivalency to Apple's retina displays. If the screen size is any larger, you need a resolution higher than 4k to match the same pixel density, meaning a 32\" 4k monitor will be less crisp and retina-like. It's the same number of pixels spread over a larger area. As designer and developer myself, 2 of these 24\" 4k displays create the ideal workspace for pixel perfect quality and multi-tasking. I also appreciate the tactile (mechanical) button for power and menu functions instead of the all-too-common invisible touch sensor. It's also on the bottom which keeps the face clean, but is easily found by feel, directly below the LG logo.","69":"I bought a 2k 27’ 165hz previously as an external monitor for my MacBook Pro 2017. The problem is the resolution is just not high enough for me. When I took a screenshot on that, the text is kinda blurry. With this I can barely tell the difference between it and my MacBook. However, the choices of refresh rate I have, with the hdmi cable that came with it, is 24, 25, and 30hz with the “Default for display”.  Just ordered a usb c to DisplayPort cable to enable 4k@60hz. Hope it’ll work!","70":"I've been using this monitor for over a year.  Love it image quality.  But it has not audio and a completely fixed stand with no adjustments whatsoever.  At some level I knew about these omissions when buying the monitor.  What I didn't expect was how much these omissions would bother me in day-to-day use.  Do yourself a favor and spend a few $ more, and get yourself a monitor with height adjustment and sound.  I suspect you'll enjoy it a lot more than I'm enjoying mine.","71":"Amazon listed condition as \"Very good\"', however the shipment was missing the monitor power cable and the two screws that hold the monitor support to the monitor thus the monitor would have been useless had I not had a spare power cable and screws that fit.  Amazon states \"Very Good\" may mean that the item is missing parts.  Ordering \"Very Good\" items is a risk.  Don't take that risk.","72":"Bought one back in July 2017, liked it so much I got another in March 2018. I use this monitor for my Xbox One X and PS4 Pro, works without any issues. Did not like the ISP glow in dark gaming scenes at first, but now it is a non issue because I am loving the overall picture quality. 90%+ of my gaming is not with a dark in-game environment. When going back to a 1080P TN monitor it looks very pixelated, colors are weak and washed out. I rather have the 4K ISP over the 1080P TN due to the rich vibrant colors and resolution upgrade of this monitor. Gaming with 1080P consoles like the Nintendo Switch also looks amazing on this 4K display, the higher pixel count really adds a better visual, even though it is not a native resolution upgrade. Many monitors when running non-native material look blurry, but this 4K monitor running 1080p, the visuals look sharp and impressive. Great value for the price.","73":"I used it with iMac (Retina 5K, 27-inch, Late 2014) and it does work well.The only flaw - PPI doesn't match and colors are not the same. Anyway, this monitor looks much better than others.Plus I wish it had some height adjustment control. I think I should invest into a proper Vesa mount or something like that.","74":"Looks amazing the size is better for first person shooters but I still wanted to keep the 4K I was coming off of a 27 inch 4K LG monitor and I love this one way more for all games and video editing","75":"Amazing gaming monitor. Only slight thing of note, and maybe I'm just new at all this, but they really aren't playing when they say \"use our cables\" I tried using an hdmi and display cable I bought off amazon and got some bleed through from my desktop when I switched over to hdmi. Once I popped in the supplied cables, problem solved. Amazing product 10\/10 am going to buy again","76":"Was looking for a 24\" 4G display and they are becoming endangered as most people seem to be buying 27's.  Hooked up to a new mac mini for basic browsing and video (no gaming), and am blown away by the crispness and responsiveness.  Physical bevels are roughly 1cm on sides and top, 2cm on botton.  Thickness is ~3cm, which is fat now and will feel obese in a few short years.  But I don't care too much about that.  Mainly I'm delighted with the crispness and clarity of the display.","77":"This is my first 4K monitor, and for the price point, it's excellent! Great color representation, minimal IPS glow, no dead pixels. My only two gripes about the display are:1) It's a bit wobbly compared to my \nDell UltraSharp U2414H 23.8\" Inch Screen LED Monitor\n. This is probably due to the connecting point between the base and the screen being a bit low on the back of the monitor (and cheap).2) The only adjustment you can make is the forward tilt. You cannot raise or lower the screen, and you can't tilt it to the left or right.Of course, this monitor is obviously a budget 4K, so it's hard to be upset at these minor points. While the stand is subpar, the screen quality itself is excellent and you definitely can't go wrong with this if it's your first 4K display.","78":"This is main screen I use of 2 plus laptop screen itself. Perfect size for business and pleasure. Exceptional clarity.","79":"bought 2 screens for my desktop, have them on a pole mount. 4k is definitely the way to go. i don't use them for gaming . I was told 4k screens would ease eye strain when one works in front of multiple screens all day. After 2 weeks, I agree with that recommendation . 1 caveat, if you need a cord longer than the supplied one, do not buy either a converter or an extension.  Buy a new cord that is at least the full length of what you need so there is a solid 1 line connection. Bottom line, great screens."}}