{"reviewer":{"0":"Steven C.","1":"James Szal","2":"hugo","3":"Maria M.","4":"FitDoc","5":"Isaac","6":"Jacob","7":"Justin Earp","8":"Joshua Leonard","9":"Sheldon L. Baker","10":"justin r masuda","11":"L.S.","12":"Tori","13":"Cartridge Buyer","14":"Amazon Customer","15":"Issa","16":"Nicole Flores","17":"Logie","18":"Amazon Customer","19":"Lynn","20":"mmthrax","21":"RS","22":"Joseph","23":"John M","24":"Erik","25":"Old1977L","26":"Kindle Customer","27":"Amazon Customer","28":"Austin","29":"L. Reese","30":"Jade","31":"Leonardo Rodriguez","32":"Nancy Botello","33":"Jared Goodwin","34":"Jon Gordon","35":"Joseph G","36":"Rock&Ice","37":"Leon Hurtado","38":"trailrnr","39":"James Rhine","40":"Guillermo Merlin","41":"Blue Marble","42":"Alan","43":"A. Watman","44":"J-F","45":"Benypete23","46":"Nochoice","47":"Concerned","48":"Amazon Customer","49":"GEMM","50":"Maldoc","51":"K. Williams","52":"Kevin Anderson","53":"Angel Salazar","54":"KeithGPS","55":"Mav2Knight","56":"Christina Frink","57":"turkeygobbleneck","58":"Alana","59":"alexandra estevez","60":"Devin K Smith","61":"Dylan Hunt","62":"John","63":"Cassie","64":"Olivia","65":"Amazon Customer","66":"Rocky_Mtn_High","67":"Above board","68":"Bryan Jewell","69":"Luis"},"content":{"0":"Assembly was fairly quick and easy using a 15mm socket wrench (instead of the included cheap multi-tool). Two of the bottom bases had logos, so I put one on each handrail facing outwards. A third bottom base had a warning label which I put on one of the handrails also facing outwards.I recommend placing the loosely assembled parallettes on a flat surface before tightening the nuts down. If you're having problems with them wobbling make sure you have all of the bottom base end caps on in the right orientation as there are four possible orientations and only one is correct. After assembly my parallettes seemed stable until I rotated them 45 degrees on my floor and then they seemed to wobble a bit, so I suspect this is a problem with my floor versus the parallettes.The parallettes seem to be sturdy and well made, but I have a couple of minor gripes. There's about 4\" of knurling on the two ends of each handle separated by about 5\" of smooth in the middle. It seems to me it'd make more sense for the knurling to be in the middle, but I'm a novice and perhaps it's common to grab the handles towards the end. I may end up wearing workout gloves or putting tape on my handles. The manual comes with a list of some warmup exercises, but no exercises that use the parallettes (which I suspect is because of liability issues), but there are plenty of videos with parallette exercises on the Internet.","1":"The only complaint i have is that one bar has knurling and the other one doesn’t. It looks like a factory issue. Other than that I have no complaints. Very sturdy with no wobble.","2":"This is perfect for at home exercising and just what I needed. Assembly is fairly straightforward (although provided instructions are awful) tightening it was a challenge with the tool they provide but it does work","3":"First of all, I do not have weak hands and have been practicing aerial acrobatics for over 10 years - mainly on aerial fabrics. I bought these to help with some condition exercises, pikes, hip flexor activation etc, maybe even planches one day... They are solid and sturdy however, the metal and metal \"texture\" hurt my hands quite a bit - to the point where my hands gave out BEFORE my legs or abs when doing any exercises with this thing. I almost sold it until I spent extensive amounts of time searching for something that would work as \"cushioned hand grips\". These bars are 1.5\" in diameter which means MOST foam pipe insulation or anything you could find out there would work with these... I managed to find something that did work pretty well (not perfect) but darn close! I ended up using packing tape on one and electrical tape on the other to hold the foam wrap closed after I cut the tubes to length and slit them open. These things are AWESOME NOW! Wow, I can do so much more without having to worry\/be distracted by my hands hurting! 4 stars until I added my own DIY grips = 5 stars!","4":"exactly like the ones they have at my gym (equinox) - commercial grade, sturdy.","5":"What I like about it is you can do full range Pushups","6":"Easy assemble, no complaints, solid build Kudos for supplying nylon locker nuts.","7":"They took less than 5 minutes to put together and feel sturdy. They come with a wrench if you need it…not a very good wrench, but better than what is included with ikea furniture. Expected some wobbling and was pleasantly surprised when I found that they sit flat and stable on the floor. Only downside I have is the pads do slide a little on wood floor, but tossing a mat under fixes that.","8":"Very sturdy and fun to use, but I wish there was grip in the middle of the bar. My hands get sweaty and I can't grip the middle. I can still do everything I want while holding the ends, but I am just confused why they designed it like this.","9":"I bought these to do inclined push-ups with a greater range of motion as suggested by Marcus Filly of Functional Bodybuilding (look him up on YouTube).  Anyway, these parallets are serving that purpose well.  They are sturdy.  Where they meet the ground surface they have rubber contact pads that stay in place and don't slide around.  I am looking to use these for years to come in my callisthenic strength training.","10":"this was really well built. very happy with my purchase.","11":"Nice and sturdy.  My son uses it as paralletes for gymnastics, and for basic dips.  He's about 4 feet tall and able to go from pike to standing.  That wouldn't work if he was much taller.Easy to assemble if you use your own socket wrench.  If you use the crappy one that comes with it, it will take you forever.","12":"I mainly use for push ups. Easy to assemble, sturdy and the grip they use is good","13":"Previous reviews have debated a wobble issue, and my set contained one parallette that wobbled and one that didn’t.  The stable one is perfect.  The wobbly one has a warped handrail plate (where the fasteners join the bottom of the handrail to the capped crossbar that forms the perpendicular base), but by reassembling that section with a flat nylon washer between the plate and the crossbar (see attached photo), the warped parallette is now just as stable as the other one.Meanwhile, the packaging was superb, there weren’t any missing parts, and I used regular tools (instead of the thing that was included) for an easy assembly.Haven’t found the handrail texture to be helpful (smooth in the middle, barely textured at the ends), but - overall - these parallettes and a 30-cent nylon washer are much more affordable than the bolt-together set from Rogue, and that’s basically what I was hoping for.","14":"These things are very stable","15":"I was thinking of canceling this order after making it, but it actually ended up being a great investment so I can't complain at all as the quality is quite good for the price.Feels very sturdy and stable, and was easy to assemble, I heard some reviews saying the legs were uneven but that was due to the end caps being loose. A little squeezing and the lengths matched up as can be seen above.My only complaint is that I wish the textured grip was a little more textured, it adds some grip but not a lot when sweaty. Investing in some grip tape and\/or gloves seems like a good idea.Overall very happy with the product and they arrived 7 days earlier than expected so can't complain there either. They were apparently too big to ship to my apartment so I had to ship them to a friend's is my only complaint here.","16":"It’s on the pricey side but , the quality you get is worth it.","17":"very sturdy!","18":"These bars are thick and meaty, a great addition to my COVID 19 emergency gym set up, lol. But really they have a nice fat feel to them and allow me to go deep on my push ups. I use them for triceps as well. I literally threw my old wimpy push up bars into the recycle bin. I love these bars.  You can see them in my picture just to the right of my dumbbells.  Did you know push ups make you real strong and shape you well?  Get some of these and get going, what are you waiting for.  GO!!!!","19":"This is very sturdy and well made, I got this for a gift for my son and he loves it.","20":"This is a good piece of equipment.  You can tell when you have been had with paper thin stamped steel garbage with crappy welds.  This is NOT that.  This will last a long time and do the job.","21":"Easy to assemble, comes with its own wrench.Use this for pushups, planks, dips, L-sitting, etc.  Little short for shoot-throughs or whatever they're called.  I'm around 6' and just under 200lbs.I have a wooden floor, and the pads on the base aren't great for resisting slippage.  I put the paralettes on a towel when I'm concerned about that.  The handgrip textures also aren't great for slippery hands, but I've managed without any augments for now.","22":"Great pair. Only complaint is the faux knurling(texture grip) is in two segments, one forward and one backwards from the center.....why is it not just one in the center?? Lol what?","23":"These are beast... solid as if they were welded... I love the thickness and they are perfect. Not sure about the bad reviews because these are badass. I’m an intermediate calisthenics guy and love these. Definitely will take me to the next level. I would suggest some chalk to reduce in slipping but I also use the Aeolos gymnastics hand grips which are perfect for these to get amazing grip and cushion and wrist support. Buy them both and some hand chalk and become a super beast.","24":"Very sturdy and solid. Can do all types of workouts and they don't budge one bit. I've seen a lot of strength increase at the gym ever since working out on these a few times a week. Would recommend anybody of any age and size to try them","25":"These are great.  They are very sturdy.  I mostly use these for push-ups in order to get a great stretch.","26":"Easy to assemble and very sturdy. Highly recommend","27":"The product is great! When in action, it doesn’t move on the cement! However, it does slide on laminate hardwood floor so place your mat down. It doesn’t have cushion on the handles so definitely wear gloves (especially if you naturally have sweaty hands).","28":"Like the rest of the reviews say, this is a very sturdy set of parallettes that I feel confident using. I also suggest wrapping these in lacrosse tape because they're too slippery by themselves.There are 2 small issues that do not warrant lowering my score:- The tool that comes with this set to tighten the nuts is worthless. Use a socket wrench if you have one.- If you do jump-throughs or a variation of it, wear shoes. The end of the nuts are exposed and you can easily catch your foot on them (I already did)","29":"These bars are high quality and have been a great addition to my home workout routine.","30":"I love it","31":"These are really awesome. Durable, sturdy and made a good material. Assembly was easy; however, the multifunction tool was not very good at all. I just used my own ratchet & socket set. It was much faster that way, but the tool has zero bearing on the overall condition and function of the push up\/hand stands.","32":"Love it. You can carry it anywhere because it is light and very easy to storage. I use it daily for my morning routines. The best thing is that you can use both or one if you want. Also by been such a small and simple object you can make all kinds of work outs. This is a must have ;) you will not regretted.","33":"These parallettes are perfect!  I'm working into an intermediate calisthenics level and these have been great to grow my workouts!  They will serve well into the future with their durability and stability being a key factor for me.  The heigth is perfect as it gives me plenty of room to move through positions and gain confidence, but not so high I'm afraid to work on handstands off the floor.I would suggest using a socket wrench to cut assembly time down a bit.","34":"Cannot be assembled with parts in the bag. You can’t tighten as the screw just spins. Even with Alan wrench and clips very hard","35":"This thing has some weight. The one thing I would note is DO NOT BOTHER WITH THE ASSEMBLY TOOL. The tool they send is horrible for assembling these. I'd reccomend you use a standard crescent wrench to torque down these nuts.","36":"Just received and assembled. Fast shipping easy assembly (had all tools necessary included, but a ratchet will make it faster). Seems to be of high quality material and construction. Very similar to Rogue parallelets that I have used at my gym, but at significantly lower price point (my reason for going with these). The demensions are nearly the same, but Rogue’s set is 15” tall vs 12” for these, which shouldn’t affect performance for my use that I can anticipate.**update** great seller customer service!! One of the foot pads fell off during a move. I contacted the seller and they promptly sent out replacements!! Thanks!","37":"These are awesome.  Zero complaints.","38":"These are great quality and sturdy. My only gripes are 1) they slip while on my laminate flooring, so a yoga mat or rug needs to go underneath and 2) the corners of the rubber feet are a bit sharp, so it hurts if you accidentally bump into them. I recommend covering them with a mat or cloth.","39":"Great product! Only thing is it hurts my hands. They should have supplied some kind of pads for this. Other than that though, I love it.","40":"These parallettes are pretty nice but one proble it the bases for these. They are not even as all should be. This can very easily go unnoticed but these are things you should look out for considering you are paying $60 for quality.","41":"I have only owned it for a week.  it was easy to assemble.  Seems very solid.One of the parallettes has very good solid knurling.  The other one has very wimpy, shallow knurling.  I am not sure why there is a difference between the two.  Poor quality control?","42":"Product is good and sturdy, only issue I have is.. it’s missing a whole set of screws and washers. Luckily I had my own to assemble it with but would have been nice if it came with it like it said it would in the manual book and description on the page. Also has a small scratch on it.. not sure if it was used or not hit i cleaned and sanitized it. Other than that.. product is sturdy and works wonders.","43":"These are a nice size and very well made. The only thing I don’t like is you have to be very careful not to hit your toes if you’re trying to bring your feet from back to front. I don’t have broad shoulders so I can’t make any space between the supports at the bottom. I’m always interested in finding equipment that is easy to store, and gives me some variety for exercise. Parallette exercises are harder than they look!!","44":"I got these bars so I could do three things: 1) deep and wide pushups, 2) pike-position leg-raises, and 3) parallel bar handstands rolling up from pike-position leg-raises. These bars are totally solid and facilitate all three of those exercises while taking up a minimum of room. When I combine these with rings, I have everything needed for killer upper body workouts. These bars took about 10 minutes to assemble using the tool provided. Using your own socket wrench would cut the assembly time in half. I recommend these bars.","45":"New fav to use in my gym","46":"Love them but seem a bit short. I'd guess you'll be better off in the long run holding for clearance. Just make sure to count your parts. Amazon wanted me to send the whole set back for two missing washers. They really don't need any more money but I could imagine they'd save and make a few more dollars by having a separate dept devoted to screw and washer replacement.","47":"It does exactly what I wanted","48":"My son absolutely loves these. He says they are super sturdy and easy to move around. He is happy.","49":"Great minimal addition to my indoor exercise equipment. Super sturdy and just the right size!","50":"Great built! Strong enough for an elephant.Buy it!","51":"Really heavy duty and easy to put together.  10 min max.  Great for the price","52":"I was completely surprised by how sturdy and nice these were. I didn't have high hopes, but I didn't want to break the bank either. When these things came in, I was blown away by the quality construction. My weight floats between 225-250 and I've never once worried about these things buckling. The two grooved hand location are also very nice. This allows me to find my grip without having to stare when doing some intermediate moves.","53":"Like the design and build quality but disliked the shipping quality imperfections can lead to long term malfunction.","54":"The sturdiness","55":"What can I say.  These are super sturdy, tall enough and solid.  They are perfect for any exercise you can think of, any presses etc...","56":"Great addition to my garage gym","57":"I received one bar with the grips and one without the grips.  I contacted the seller and they immediately resolved the issue by sending me another bar.  The product is very sturdy, well made, easy to put together...plus great customer service!","58":"Great equipment!","59":"Great product!","60":"Works great!","61":"Amazing","62":"I got all the materials & the tool to assemble the Paralletes. However, once assembled it is not stable on a flat surface. it annoys me that it wobbles. This should never happen for calisthenics equipment. This is very disappointing.","63":"sturdy material and construction.  Works great for my needs and routine.","64":"Gymnast approved 💯","65":"Both are wobbly. Trying to see how you adjust for it.","66":"Very sturdy. Great for dips, yogas, and other home workouts.","67":"This is my first experience with paralletes.  Product is excellent.  Easy to assemble(I used a ratchet set).  Very sturdy and I weigh 220 lbs.  Looking forward to some intense workouts.  You can’t go wrong with this product.","68":"These are a very sturdy product. The quality at the price cannot be beaten. The feet do move when you are installing them, so ensuring that they are level will help to eliminate any wobble that might occur.","69":"these parrallettes are a great product for the price! I waited to a few months to leave my review due to wanting to see how they held up. They are great, easy to assemble and packaged well. I highly recommend if you are looking for a good set."}}