{"reviewer":{"0":"Henry M. Espinoza Jr.","1":"Amazon Customer","2":"Nancy Elizabeth","3":"Jacklyn Schulkers","4":"andrea campbell","5":"Abigail Hansen","6":"Bruce D. Wilson","7":"Libby","8":"LAZARO  DIEZ","9":"terena keeney","10":"bandino","11":"purpleyooper","12":"petlover","13":"Ronald L. Bedry","14":"Melissa","15":"Shae","16":"Kalpana Nepal","17":"Eugene Dubowski","18":"Sam46","19":"Jmac","20":"R. Perry Jr.","21":"Amazon Customer","22":"Rosemarie M. Wilkinson","23":"BCM","24":"Allidap","25":"Kindle Customer","26":"Howard W","27":"Diane Johnson","28":"Tammy","29":"Linda Haney","30":"mohama ahmed","31":"Fab","32":"Amazon Customer","33":"Austin","34":"Kathy Gonzalez","35":"Bruce","36":"Ashley","37":"Paul Banta","38":"Lu71","39":"Diane Scott","40":"Gregg","41":"harold silverman","42":"Tammy Scott","43":"Amazon Customer","44":"Jake","45":"Trent C.","46":"SJ Holley","47":"Jeannie","48":"Johnathon crumrine","49":"Rhianna W."},"content":{"0":"I like both pans, I've used them a few times and I am very satisfied with the workmanship. the handle is very sturdy and easy to grip. I really like the glass lids with the vent holes that came with the set. The pans are easy to clean and store. The pans look nice as well.","1":"I love these pans! I use small pots a lot since it's just 2 of us now. These are great for warming, cooking or sauces. They seem very durable and very nonstick.","2":"They work perfect and they clean up nicely","3":"LOVE LOVE THESE POTS ! THEY COOK EVENLY.AND CLEAN UP IS A BREEZE .IVE HAD THEM FOR ABOUT 6 MONTHS!","4":"I use it to make easy eggs  oats and soups dishes","5":"I was surprised at the quality of these for the price. Have been loving them so far and they’ve held up really well and I’ve been using them pretty often over the last few months and they show no real wear or anything","6":"Very nice product","7":"Funny thing is they sent the frying pans by mistake but I love them so much I’m keeping them and ordering these again.","8":"Good","9":"Easy to clean","10":"Easy to clean and doesn’t stick and value for money","11":"Love, love these pans. Sits flat on glass top stove and sturdy built","12":"Color was Great.  Cooking in them is just perfect......I'm happy with them.","13":"Well, I use these pots to make all sorts of delectables.","14":"product looks as expected","15":"My First Pot Set It came in handy easy to clean & strong quality","16":"I love very easy cooking","17":"Large pot didn’t come with a lid as shown on pictureProduct missing lid","18":"Have not used them yet but I think they are just what I need.","19":"I used pots tonight for cooking vegetables. Heats quickly. Easy to handle and clean. Attractive color and appearance","20":"easy cleanup and a sturdy product the wife said .","21":"Like the easy clean up.","22":"EVERY DAY COOK WEAR","23":"The value of the item was what I looked for and different sizes.","24":"I am very pleased with these pans.  They are extremely easy to clean.  They are sturdy and durable.  The covers are glass so you can see through, and are vented.  I use these pans almost daily.","25":"The smaller pan serves really well as a pan for small sized veggies or gravies, etc .  Both pans are super easy to clean, and I love that they both have lids.  Perfect for what I needed","26":"..and I like the red too...","27":"I needed a nonstick sauce pot and this set had 2, so I saw it as a bonus. I was pleasantly surprised that it is a very good, sturdy, well-made pot, that for the price has exceeded my expectations.","28":"These pans are great non-stick, but they have 2 major drawbacks to be aware of. They are so lightweight that on our gas stove grids, they are not always steady unless placed just right. Secondly, they are clearly made of soft metal. Each, at separate times, fell on our vinyl flooring and bent in such a way that the lid can no longer go on. The floor is vinyl so not terribly hard. Although the non stick worked great, I will not replace them with this same brand.","29":"They are very well made and durable (not thin or flimsy) in addition to being very attractive in color and design.","30":"I want to make tea the big size work the smaller one notI felt I been fooled","31":"The media could not be loaded.\n                \n\n\n\n Easy to clean, doesn’t stick and light weight.","32":"Pots are such bright spots of color in kitchen! Easy to use and clean. Lids and pots have handles and knobs that don't get hot.","33":"Not sure why they need to be as thick as they are, maybe you will like that? Water seems to take a lot longer to boil because of their thickness, and as I'm a bachelor who sits on the couch and eats out of the pan, they're too heavy too.","34":"I like the pots, because they are lightweight, sturdy and easy. It also a ga reasonable price.","35":"I learned a long time ago when you buy cheap pans you get cheap pans right? These were cheap (relatively) but the are well made and sturdy. They are really nicely done. I had a set of $500 Berndes pans and I hated them from the get go. They had a lifetime guarantee that was such a pain to replace pans that I finally through them away. My 92 year old mother is very hard on pans so I buy cheap pans and hope they last a year. What a surprise...I actually enjoy cooking in these. IMO...buy them and love them!","36":"So I think these pots have been great. Easy to clean. My ONLY issue is that the smaller pot is way off balance. The handle weight makes the whole pot tilt. Which sucks if you're just doing a light sauce or whatever. Definitely almost fell off the stove when I was doing a garlic butter sauce, which is obviously dangerous. So just be mindful when doing light stuff in the smaller pot.","37":"They heat up well and they are thick enough not to bow if dropped from a short height.  My only gripe is they are shallow by at-least an inch from my old set.  I have to pay attention when boiling that it doesn't spill over (which is probably a good thing), but I need to control the temperature of the burners more carefully to avoid spillovers, there's no leeway.Other than that, they work fine...","38":"It was what I expected, and I am very pleased.","39":"Exactly the size I was looking for! Handles are cool to the touch too.","40":"Cooked what I needed to cook","41":"looks and works  good","42":"I bought these for my travel trailer because they were small and light weight. Easy to clean in small places.","43":"It easy to clean,sturdiness and it is worth my money. I recommend it.","44":"Despite what the description says, the 1-qt pot I received was NOT induction compatible.","45":"Both the pots have sauce pan “tips” I guess you would call them?  Like on a measuring cup to make sure it puts and doesn’t splash.  Anyways those cause the lids not to seal.  Also their is a hole in the glass lids so steam is constantly getting out.  They are sturdy and easy to clean, but if your looking for something to boil or steam things in that require a lid, get a different set.","46":"My old pots were kaput, and everything began sticking. These pots work great. I use the larger one mostly for rice, and it works like a charm. The rice is done and it comes out fluffy and perfect. Nothing sticks.The smaller one is a perfect size for moderate servings. The non-stick works great.","47":"I am gradually replacing my old cookware, which has seen it's day. I love these new saucepans. Sturdy, non stick and were a great price.  I have used them a lot since my purchase with no problems. Heat up soup, make oatmeal, cook rice and vegetables all without sticking or scorching. Food cooks evenly and it slides right out. Clean up is a breeze. I'm happy and satisfied.","48":"Too small","49":"I was looking for just a couple of pots for soups and pasta sauce, but I couldn’t find any that weren’t included in a big massive set, which I didn’t need, so this set of 2 was perfect! They look good and heat evenly, and are easy to clean. Couldn’t ask for better!"}}