{"reviewer":{"0":"Melodie Vue","1":"M. Stalcup","2":"Stephanie Paul","3":"CK","4":"Jim Kinney","5":"Amazon Customer","6":"Marina M.","7":"ZoeR","8":"Jennifer","9":"Ali B.","10":"Avery","11":"C. Ratcliff","12":"GG","13":"J. Allen","14":"Ian Stiltner","15":"Jennifer Cairns","16":"Kevin P.","17":"Valerie","18":"Patrick","19":"Lynda Davis","20":"Elizabeth Perez","21":"naturemama","22":"mRs. ChAvEz3","23":"Beth M","24":"Big Jim                                 Amazon Customer","25":"Amazon Customer","26":"Amazon Customer","27":"Alicia N. Young","28":"Isaac","29":"CBO77"},"content":{"0":"Bought these cases for my kids. This case is definitely built for protection. My only con about this products is that it was sort of a pain to put the case on the iPads and the buttons are hard to press. Overall it’s a nice case.","1":"I read a lot of mixed reviews on this case. I have only had it a week, but so far so good. I bought two, for both of my daughters iPads. There isn’t a lot of case options (otterbox) anyways for this particular iPad. We were using iPad Air 2 otterbox defender cases for them. It wasn’t a perfect fit, but we made it work for a few years. This unlimited case is a nice tight fit. The plastic built in screen protector is a joke just like the one in the defenders. I pulled it out and got the glue off with goo gone and put a glass screen protector on the iPad. I would not trust the case with just that flimsy piece of plastic as a screen protector. The only negative I have to say about this case is it’s a pain to get on and off. I used a pair of tweezers to help get it on and that made it less painful. Pulling it off, you need to be careful as the top piece isn’t very strong. The stand is like a heavy duty slap bracelet from back in the day. It works well for its purpose. With the options available for this particular iPad, I think this is a good choice.","2":"Okay, so this case packs a punch and I mean it’s hands down the BEST case that I’ve bought for my sons iPad and plan to buy for mine just haven't yet because the plain gray color doesn't excite me; however, this not only protects my sons tablet but also allows him to watch his shows when he’s on the potty. The case is sleek, it protects front and back without interfering with the touch capabilities. this case is amazing and I can’t stress that enough. The only con I have about this case, is that when it’s on its on! If you don’t know how to remove this case properly you will hurt the tips of your fingers. I have found that removing the case starting from top side (where the screen shut off button is) allows you take off the case quickly and I usually don’t even remove the whole case unless I need to clean the back of the IPAD not the case but the actual iPad it’s self which is hardly ever as I’ve noticed that the case keeps the device clean and protected; however, the actual case gets pretty dirty and the only reason for this I’m pretty sure, is because this tablet belongs to a toddler who takes this device literally everywhere; his sandbox, the potty, lunch time, car rides, outside etc. I usually clean and disinfect once a day with a Clorox wipe and it’s good to go! Hopefully this review is thorough enough. If you’re planning on buying this case BUY IT, not only, is it sold at a discounted rate but it protects your investment!","3":"Overall a great case, with 2 flaws I could see:1) One of the most difficult cases I've ever put on\/taken off, ever.2) It came with a bit of damage - it was difficult to tell if it happened during shipping or not, as the case didn't come in a box (just a plastic bag) by itself in a padded mailer. May have been a return?Otherwise, this is a nice case - it's slim, the included screen protector is great, and the stand is a really really neat design. It pops up easily and can also serve as an additional grip on the iPad, and is removable if you don't want it on there. Just wish the border wasn't a dark gray - for whatever reason my eye gets distracted by the edge's contrast with the white bezel of my ipad when I'm drawing\/reading on it. I'm really weird about that though, and I doubt it'd bother anyone but me. Overall a nice slim protective case.","4":"This was a replacement cover. I had had an exact cover for 5 years and loved the way the stand worked on the back of the cover.  It was ingenious how well it worked.  The stand finally wore out and I could not repair it.  I looked for a replacement last year and could not find one, but this year I found one and it was delivered in three days. Very very happy with the stand and the quick service.","5":"After small struggle to put it together, really pleased with the result. Love having the front, back and sides protected. Best cover of its kind!","6":"A little tough to put on and take off but good case. Very protective.","7":"I carry my iPad 6th gen in my purse everyday & also use it in a woodshop. I've had this case for 2 months. The Otterbox UnlimitED is the first case I've owned that keeps my iPad clean and safe. The screen cover does not affect the use of the touch screen.  Its also thin enough to fit in the side pocket (meant for tablets) on my purse. This case is difficult to remove but that's on purpose so students can't remove it easily.  The UnlimitED is meant to be sold for educational institutions only. I am happy I found it on Amazon. Its worth the higher price.","8":"Exactly what I wanted & quick shipping!  Thank you!!!","9":"I love how otter box case fits my iPad, but a bit disappointed that the stand has broken with very limited use and the case cracked on the front from removing to clean.","10":"A name I can trust, classy branding, good looking case, not bulky. The kickstand is pretty cool. The case does not lay completely level when it’s on its back in portrait mode due to the asymmetrical position of the stand, but I rarely use my iPad like that hence why I bought a case with a stand.","11":"Purchased this for an ipad used by our kids. Not quite as robust as I expected based on other OtterBox cases I have owned in the past. Hasn't been dropped yet (knock on wood) so I can't speak to the level of protection provided by the case.","12":"From all ipad cases I’ve tried this is by far the best!! Highly protective, great size, looks really good and the foldable stand on the back it’s just genius!...now I just wish they’ll make this exact one for all other ipad sizes!!","13":"Integrated screen protector will not allow use of another screen protector... It locks down the device in the case and won’t close. Without being locked in, the device isn’t secured. It’s a great case outside of that and I’m sad to have to return it. Don’t worry about what the commenter said about coming in plastic, they’re meant to be sold in bulk.","14":"I needed an iPad for school and just like with any iPhone, I knew it needed to go into an Otterbox IMMEDIATELY if it was going to survive me as its owner.  It took some time to get the iPad in the case but, of course, the same thing happens with the iPhone.  And since then, it has survived drops and everything else.  Plus it looks pretty cool and the pop-out stand feature is pretty slick!","15":"We’ve had this case for a couple months now on my sons iPad Pro because he broke his previous iPad without one and it’s holding up well!","16":"A little pricey, but excellent case. Sturdy protection that is both slim and functional. Still shows off the iPads design without sacrificing solid protection from damage. Built in stand that folds away when not needed. No need for a screen protector either. OtterBox has a great reputation and stands behind their products.  Love this case enough that I purchased a second one.","17":"The most difficult Otter Box case I’ve ever put on any mobile\/tablet devices.  Definitely not for someone with any hand impairments (like arthritis) or you’ll need to ask someone to assist you in putting the case on. Case seems sturdy, as does the stand which is sort of like a heavy duty snap bracelet.  Power button is also incredibly difficult to use with this case on.  If there weren’t so few reliable protective cases for the 6th Gen iPad, I would’ve returned this one.","18":"This is a great case. Its like shielding your ipad in a thin layer of plastic with otterbox edges. Yes I know it is designed for schools, but it is a great supportive case for anyone. If you could knock it on anything it would be aesthetics, but isn't the protection of your 250+ dollar investment more important?","19":"I like that I am not having to \"flip open\" a flap to use the I pad.  I like the pop out stands .  Really there is nothing to not like.....I have Otterbox for my iPhone and would recommend to anyone especially to kids and seniors who are more prone to dropping things.","20":"The case fits nice and tight, I love the idea of the stand however it could be a little more sturdy. But my son loves it he can hold it with no problem.","21":"Kids have a very difficult time adjusting the volume and turning ipads off as the buttons on these cases are super stiff and hard. Most likely generic Otterbox as this brand usually delivers great quality, not this one! Do not buy, especially for kids.","22":"Best iPad case ever and love the pop up stand feature and the sleek design!","23":"This is just a basic cover but it does the job well.  Very good value.I couldn't answer about water resistance because it was not applicable to us.","24":"gave as a gift and the person was very pleased with the design and the small stand on the back","25":"Easy to put on","26":"Very sturdy and durable. Protects my iPad wonderfully with drops and messy hands of my toddler.","27":"Works great for our IPad. It is slim and unobtrusive.","28":"This is an amazing case just like any otterbox product, it offers amazing protection without being too bulky, the screen protector is great I'm confident given this to my kid to play with the ipad without being worried that its going to break.","29":"Kid proof and has some water protection. Good buy."}}