{"reviewer":{"0":"Charles K. Lucas","1":"ceejayoz","2":"Crazy","3":"banda543","4":"CC","5":"Richard","6":"Melrel05","7":"D Wilson","8":"Pandagurl","9":"🌟 Emma Elizabeth 🌟","10":"A. Hsiao","11":"Ernest Stalnaker","12":"Rama Rao","13":"Rachel","14":"Sunny","15":"Lerunia","16":"Ali Julia","17":"XennialLife"},"content":{"0":"I would buy again. I have to refill it twice when I use it, take the tip off and refill. Does a good job and the 2 tips definitely have different power streams of water. Very pleased with this.","1":"One drop onto tiled floor and our couple-week old unit was permanently broken. Replacement tips do not appear to be purchasable.","2":"I gave this product four stars because the product isn’t rechargeable and requires batteries. Besides that I do enjoy this water flosser. My teeth are a bit crowed so I have to make sure I floss well because food gets stuck in between them easily. This water flosser is not only refreshing on the gums but it works very well and gets the food out quickly! I love that it isn’t too intense on the gums because my teeth and gums can tend to be sensitive. I do feel the price is affordable and the product is priced righted.","3":"The reason this doesn't receive 5 stars is because it uses 2 AA batteries and is not rechargeable.  This has left me scratching my head.  I have never used a cordless water flosser that was not rechargeable.  I wish I could have used this til the batteries went dead to see how long a set of batteries holds up in this.  I normally have to charge my rechargeable cordless once a month.  After considering this longer, I realize there is an option for me to use rechargeable batteries in it.  This will eliminate throwing away batteries.I have been using it about 4 or 5 days now.  The battery is still strong.This is a basic water flosser, but rivals the name brand one.  The jet of water is soft that I don't feel like I am blasting my gums away but effective that I can feel it working in between my teeth.There is one button.  One speed.  There are two different tips- low pressure and high pressure.  I have  been using the high pressure one, I think.4 stars: I was and am disappointed this is not a rechargeable.  As far as quality of the jet stream it works great.  Better than most if not all of the generic ones I have tried.  The price is very fair, but to have to keep a supply of batteries to use it, I probably won't continue to use it once these batteries go dead since I do not have rechargeable batteries on hand.  I use batteries when I need to, but if there is an alternative (like recharging) instead of putting batteries in the garbage can, I am going to go with that choice.","4":"I got this for my son who doesn’t brush or floss well and was getting food stuck in his teeth. It works well, It’s like a mini pressure washer for the teeth! It’s pretty powerful, it shoots water to the ceiling. It’s a bit messy for my son, but with some practice, I think it will be worth the mess. For now, I am helping him and  we are practicing using it in the shower until he gets the hang of it.  It works better for him that it’s cordless and pretty simple to use. Battery charged. Water tank holds enough water to cover all his teeth. The base is large and it stands well on it’s own when not used. B\/c messy, I plan to use it 1 times per week and not daily. Overall, It’s good for regular teeth health maintenance and plaque control.","5":"This has left me scratching my head. I've in no way used a cordless water flosser that became no longer rechargeable. I wish i may want to have used this until the batteries went lifeless to see how long a set of batteries holds up on this. I typically should charge my rechargeable cordless as soon as a month. After thinking about this longer, i realize there may be an choice for me to use rechargeable batteries in it. This will put off throwing away batteries. This comes with 2 batteries. It does now not have an choice to price it. It's miles best powered through batteries. It has two stress options- high and coffee. Two guidelines are provided, the only with the blue area has a better strain than the only with out a blue facet. The water is straightforward to refill. You simply open the flap and pour water internal.","6":"My favorite invention in the last few years has to be the water flosser. They just make it so much easier to floss my teeth and get my kids to floss there’s. We have a family one with different attachments for each of us that sits on the counter in the bathroom, but I wanted one that I could use when traveling. So when I came across this Amazon Basics HydroClean Cordless Water Flosser I figured it would be worth a try.It’s definitely a basic model, there are not a bunch of modes or options to chose from. But it does work very well for what it is and the price point. It does a good job of getting everything out from between my teeth and it is compact and easy to use.","7":"I have a water flosser but it is a bit large (although nice) and I really want one I can bring with me on travel. In particular I was looking for one where the reservoir was completely sealed to help minimize any water leakage when packed away after using. This flosser does have that, though one annoyance is the position of the fill hole is kind of awkward, though you can detach the reservoir to make it fit in to various awkward size sinks at hotels good enough.I like that it takes AA batteries instead of rechargeable, as I don't want to have to worry about leaving some random cord behind or finding out it is dead when I go to use it and waiting for it to recharge. It came with two AA batteries, though I ended up using lithium AAs instead of alkaline so they last and won't leak when I have it stored away between trips (I have a bigger flosser I love already at home).The flosser works well and comes with two tips: a high pressure tip and a low pressure tip. I haven't used the high pressure one much as the low pressure tip meets my day-to-day needs just fine. The water flosser produces a good amount of water flow and the reservoir is large enough to hold enough for one run through the mouth. The reservoir is nice and sealed up and so I can hold it at all kinds of angles to really get the teeth flossed from all sides.I was a bit skeptical buying a Amazon Basic brand water flosser, but it has been really working well so far, so great job Amazon!","8":"I’ve owned several of the name brand water flossers before, but this was my first portable generic version.Included in the box was the water flosser, 2 x AA batteries, manual, and two tips. One tip for low flow and one tip for high flow. The water pressure from the water flosser was quite good, almost as powerful as my name brand countertop version. If i were to guess the highflow tip felt equivalent to about an 8 out of the 10 max setting on my water pik.In order to install the batteries it uses a coin slot to unscrew cover, when i slid off the water tank the first time my battery slot popped open with it, but subsequently that issue disappeared. The water flosser is quite thick, and i have small hands so it did not feel very ergonomic holding it with one hand.  Filling the water tank was a little annoying as u can only fill it through a hole, because access is limited through that hole, cleaning the tank is difficult. I also was not a fan that there wasn’t a rechargeable battery built into this device, nor any ability to run this off ac outlet.","9":"I started out years ago with a \"standard\" waterpik flosser and loved it, but after moving and losing a lot of counter space, I was ready to try a cordless one. This is just as effective as the full size waterpik. It is easy to use and clean.","10":"I personally like using water floss more as regular floss is hard to get to the back of your mouth. What's great about them is that it isn't too harsh on the teeth and gums, but also cleans well.Quality:This product is relatively bulky and is used with 2 AA batteries which are included. I do wish it was rechargeable but with this it does mean that it is less wires. I actually found the low pressure tip to be the most comfortable. It wasn't too strong on my gums and didn't feel like it was going to injure or bruise it. The high pressure one is slightly more uncomfortable but nothing bad. It's a personally preference I feel like.Overall, solid product and definitely recommend adding this to your daily routine.","11":"My main water flosser is a Panasonic model that is rechargeable.  I have used it for a few years and it works great for me.  I ordered this new Amazon Basics model for my wife.  It looks very similar to my Panasonic one, except that it uses two AA batteries and is not rechargeable.  But I put Panasonic Eneloop rechargeable AA batteries in it, so I'm still not throwing away batteries.  Another difference between this flosser and my Panasonic one is how you change the pressure.  With my Panasonic flosser, I just press a button to increase the pressure.  But with this Amazon Basics one, you have to change the tip.  It comes with a low pressure tip and a high pressure tip.  My wife prefers the high pressure one, so she just leaves that one on and doesn't use the low pressure one.  For the price this water flosser is a great deal, and it works just as well as my Panasonic one in terms of how well it cleans.  I recommend it to anyone looking to buy a water flosser.","12":"I am using this product for the last few weeks and so far, it is working well as expected. It is making my daily flossing quick and easy. Sometimes, I use string floss first if I noticeably have food between my teeth after eating corn on the cob or an apple. I have also noticed that my breath stays fresh longer and feel smooth like I had cleaning done by a hygienist. I have also used mouthwash instead of water for a truly deep clean. It is very simple to operate and easy to clean. I especially like the portability, handheld design and removable tank. Highly recommended.","13":"The media could not be loaded.\n                \n\n\n\n My oldest has braces and she was so grateful to finally get one of these. It definitely works to clean between teeth & get to the gum line. It comes with 2 spray heads, one regular power and the other high pressure. Neither one is painful and honestly I don’t notice much of a difference. The water canister is very easy to refill.Just be careful if you don’t power off, you’ll have a soaked mirror. I definitely recommend! Amazon has great products and this is just another great example!","14":"This comes with 2 batteries. It does not have an option to charge it. It is only powered through batteries.  It has two pressure options- high and low. Two tips are provided, the one with the blue edge has a higher pressure than the one without a blue edge. The water is easy to refill. You just open the flap and pour water inside.","15":"The media could not be loaded.\n                \n\n\n\n This is my very first water flosser experience and I must say it’s definitely worth to have. I was hesitant to try water flosser before due to the fact that most came with charging stations and were kind of bulky so would take a lot of space on the bathroom counter and I don’t have that much anyway. I do appreciate this one as it uses batteries and no bulky charging station. Pressure is awesome and I got super clean and fresh feeling after using, it’s nice to have this option to keep teeth extra clean. Quality seems to be wonderful, been using for over a week and have no issues at all!","16":"The media could not be loaded.\n                \n\n\n\n I have used a few water flossers over the years, and this flosser has almost all the features that I like.I like:1. This flosser has a large reservoir. It holds enough water for me to do a complete flossing session.2. The button that turns the flosser on and off is conveniently located. It is not overloaded with features, just on and off, so it is easy to operate.3. The flosser water power is good. The water power can be controlled by the blue ring under the tip.4. The flosser runs on two AA batteris. It is not rechargeable. AA batteries are easy to replace. Flossers with rechargeable batteries must be thrown out when the battery no longer holds a charge. This happened to my favorite flosser after a few years. A few flossers I bought since then have not been as good. The Amazon Basics flosser feels like it might be as good as my old favorite.I don't like:1. The flosser is re-filled from the opening at the bottom of the container, so it is not as easy to fill fully when the opening is at the top of the container.2. The flosser comes with two tips. They come in a plastic bag without any markings. I had manually written that the extra tip belongs to the Amazon Basics flosser. I have a few flossers, and none of the tips fit other flossers, so it would have been better if Amazon marked the tip's packaging (or tips).Ali Julia reviewReview of Amazon Basics HydroClean Cordless Water Flosser","17":"The media could not be loaded.\n                \n\n\n\n This is a good introduction to water flosser but but for me the main negatives is that it uses batteries.  That might be a requirement for some but in the price range there are rechargeables around same price. Again as a introduction\/ first time using one--this will check all the boxes. But maybe after a month or two of using this-- you'll want a more featured packed flosser.But overall this does work and the power is strong enough for most people."}}